[
  {
    "year": "2020",
    "url": "https://doi.org/10.1109/ASE.2019.00064",
    "title": "DIRE: a neural approach to decompiled identifier naming",
    "series": "ASE '19",
    "publisher": "IEEE Press",
    "pages": "628–639",
    "numpages": "12",
    "location": "San Diego, California",
    "isbn": "9781728125084",
    "doi": "10.1109/ASE.2019.00064",
    "booktitle": "Proceedings of the 34th IEEE/ACM International Conference on Automated Software Engineering",
    "author": "Lacomis, Jeremy and Yin, Pengcheng and Schwartz, Edward J. and Allamanis, Miltiadis and Le Goues, Claire and Neubig, Graham and Vasilescu, Bogdan",
    "abstract": "The decompiler is one of the most common tools for examining binaries without corresponding source code. It transforms binaries into high-level code, reversing the compilation process. Decompilers can reconstruct much of the information that is lost during the compilation process (e.g., structure and type information). Unfortunately, they do not reconstruct semantically meaningful variable names, which are known to increase code understandability. We propose the Decompiled Identifier Renaming Engine (DIRE), a novel probabilistic technique for variable name recovery that uses both lexical and structural information recovered by the decompiler. We also present a technique for generating corpora suitable for training and evaluating models of decompiled code renaming, which we use to create a corpus of 164,632 unique x86-64 binaries generated from C projects mined from GitHub.1 Our results show that on this corpus DIRE can predict variable names identical to the names in the original source code up to 74.3% of the time.",
    "ENTRYTYPE": "inproceedings",
    "ID": "10.1109/ASE.2019.00064"
  },
  {
    "year": "2024",
    "url": "https://doi.org/10.1109/ASE56229.2023.00099",
    "title": "HexT5: Unified Pre-Training for Stripped Binary Code Information Inference",
    "series": "ASE '23",
    "publisher": "IEEE Press",
    "pages": "774–786",
    "numpages": "13",
    "location": "Echternach, Luxembourg",
    "keywords": "reverse engineering, deep learning, binary diffing, information inference, programming language model",
    "isbn": "9798350329964",
    "doi": "10.1109/ASE56229.2023.00099",
    "booktitle": "Proceedings of the 38th IEEE/ACM International Conference on Automated Software Engineering",
    "author": "Xiong, Jiaqi and Chen, Guoqiang and Chen, Kejiang and Gao, Han and Cheng, Shaoyin and Zhang, Weiming",
    "abstract": "Decompilation is a widely used process for reverse engineers to significantly enhance code readability by lifting assembly code to a higher-level C-like language, pseudo-code. Nevertheless, the process of compilation and stripping irreversibly discards high-level semantic information that is crucial to code comprehension, such as comments, identifier names, and types. Existing approaches typically recover only one type of information, making them suboptimal for semantic inference. In this paper, we treat pseudo-code as a special programming language, then present a unified pre-trained model, HexT5, that is trained on vast amounts of natural language comments, source identifiers, and pseudo-code using novel pseudo-code-based pretraining objectives. We fine-tune HexT5 on various downstream tasks, including code summarization, variable name recovery, function name recovery, and similarity detection. Comprehensive experiments show that HexT5 achieves state-of-the-art performance on four downstream tasks, and it demonstrates the robust effectiveness and generalizability of HexT5 for binary-related tasks.",
    "ENTRYTYPE": "inproceedings",
    "ID": "10.1109/ASE56229.2023.00099"
  },
  {
    "year": "2024",
    "url": "https://doi.org/10.1109/CGO57630.2024.10444788",
    "title": "SLaDe: A Portable Small Language Model Decompiler for Optimized Assembly",
    "series": "CGO '24",
    "publisher": "IEEE Press",
    "pages": "67–80",
    "numpages": "14",
    "location": "Edinburgh, United Kingdom",
    "keywords": "decompilation, neural decompilation, transformer, language models, type inference",
    "isbn": "9798350395099",
    "doi": "10.1109/CGO57630.2024.10444788",
    "booktitle": "Proceedings of the 2024 IEEE/ACM International Symposium on Code Generation and Optimization",
    "author": "Armengol-Estap\\'{e}, Jordi and Woodruff, Jackson and Cummins, Chris and O'Boyle, Michael F. P.",
    "abstract": "Decompilation is a well-studied area with numerous high-quality tools available. These are frequently used for security tasks and to port legacy code. However, they regularly generate difficult-to-read programs and require a large amount of engineering effort to support new programming languages and ISAs. Recent interest in neural approaches has produced portable tools that generate readable code. Nevertheless, to-date such techniques are usually restricted to synthetic programs without optimization, and no models have evaluated their portability. Furthermore, while the code generated may be more readable, it is usually incorrect.This paper presents SLaDe, a Small Language model Decompiler based on a sequence-to-sequence Transformer trained over real-world code and augmented with a type inference engine. We utilize a novel tokenizer, dropout-free regularization, and type inference to generate programs that are more readable and accurate than standard analytic and recent neural approaches. Unlike standard approaches, SLaDe can infer out-of-context types and unlike neural approaches, it generates correct code.We evaluate SLaDe on over 4,000 ExeBench functions on two ISAs and at two optimization levels. SLaDe is up to 6\\texttimes{} more accurate than Ghidra, a state-of-the-art, industrial-strength decompiler and up to 4\\texttimes{} more accurate than the large language model ChatGPT and generates significantly more readable code than both.",
    "ENTRYTYPE": "inproceedings",
    "ID": "10.1109/CGO57630.2024.10444788"
  },
  {
    "year": "2019",
    "url": "https://doi.org/10.1145/3293880.3294102",
    "title": "Formally verified big step semantics out of x86-64 binaries",
    "series": "CPP 2019",
    "publisher": "Association for Computing Machinery",
    "pages": "181–195",
    "numpages": "15",
    "location": "Cascais, Portugal",
    "keywords": "x86-64, theorem proving, semantics",
    "isbn": "9781450362221",
    "doi": "10.1145/3293880.3294102",
    "booktitle": "Proceedings of the 8th ACM SIGPLAN International Conference on Certified Programs and Proofs",
    "author": "Roessle, Ian and Verbeek, Freek and Ravindran, Binoy",
    "address": "New York, NY, USA",
    "abstract": "This paper presents a methodology for generating formally proven equivalence theorems between decompiled x86-64 machine code and big step semantics. These proofs are built on top of two additional contributions. First, a robust and tested formal x86-64 machine model containing small step semantics for 1625 instructions. Second, a decompilation-into-logic methodology supporting both x86-64 assembly and machine code at large scale. This work enables black-box binary verification, i.e., formal verification of a binary where source code is unavailable. As such, it can be applied to safety-critical systems that consist of legacy components, or components whose source code is unavailable due to proprietary reasons. The methodology minimizes the trusted code base by leveraging machine-learned semantics to build a formal machine model. We apply the methodology to several case studies, including binaries that heavily rely on the SSE2 floating-point instruction set, and binaries that are obtained by compiling code that is obtained by inlining assembly into C code.",
    "ENTRYTYPE": "inproceedings",
    "ID": "10.1145/3293880.3294102"
  },
  {
    "year": "2024",
    "url": "https://doi.org/10.1145/3658644.3691386",
    "title": "Poster: Formally Verified Binary Lifting to P-Code",
    "series": "CCS '24",
    "publisher": "Association for Computing Machinery",
    "pages": "4973–4975",
    "numpages": "3",
    "location": "Salt Lake City, UT, USA",
    "keywords": "binary lifting, decompilation, formal verification, proof automation, reverse engineering, theorem provers",
    "isbn": "9798400706363",
    "doi": "10.1145/3658644.3691386",
    "booktitle": "Proceedings of the 2024 on ACM SIGSAC Conference on Computer and Communications Security",
    "author": "Naus, Nico and Verbeek, Freek and Atla, Sagar and Ravindran, Binoy",
    "address": "New York, NY, USA",
    "abstract": "Analysis of binary software plays a critical role in software security. Reverse engineers analyze binaries to discover vulnerabilities, patch legacy software, and detect malware. Most of the reverse engineering tools have been developed from a practical point of view, and do not provide any guarantees with their results. Recently, formally verified reverse engineering and decompilation have gained traction. These formal tools are for the most part proof-of-concept systems not yet suitable for real-world reverse-engineering tasks. In this poster, we explore the idea of formalizing part of an existing decompilation tool instead. We focus on the lifting from assembly to the IR P-Code in one of the most popular decompilers, Ghidra. This step occurs immediately after disassembly. We are developing a proof system inside the Isabelle theorem prover, to automatically prove semantical equivalence between the assembly and P-Code instructions. We leverage machine-learned x86-64 semantics, to stay as close as possible to actual CPU behavior. This approach has uncovered several shortcomings in Ghidra's P-Code and the lifting it performs. By using a theorem prover, we obtain guarantees that our system of formal semantics and lifting is internally consistent. This work brings the powerful guarantees that formal methods provide in reverse engineering research to the real world.",
    "ENTRYTYPE": "inproceedings",
    "ID": "10.1145/3658644.3691386"
  },
  {
    "year": "2024",
    "url": "https://doi.org/10.1145/3691620.3695020",
    "title": "WaDec: Decompiling WebAssembly Using Large Language Model",
    "series": "ASE '24",
    "publisher": "Association for Computing Machinery",
    "pages": "481–492",
    "numpages": "12",
    "location": "Sacramento, CA, USA",
    "isbn": "9798400712487",
    "doi": "10.1145/3691620.3695020",
    "booktitle": "Proceedings of the 39th IEEE/ACM International Conference on Automated Software Engineering",
    "author": "She, Xinyu and Zhao, Yanjie and Wang, Haoyu",
    "address": "New York, NY, USA",
    "abstract": "WebAssembly (abbreviated Wasm) has emerged as a cornerstone of web development, offering a compact binary format that allows high-performance applications to run at near-native speeds in web browsers. Despite its advantages, Wasm's binary nature presents significant challenges for developers and researchers, particularly regarding readability when debugging or analyzing web applications. Therefore, effective decompilation becomes crucial. Unfortunately, traditional decompilers often struggle with producing readable outputs. While some large language model (LLM)-based decompilers have shown good compatibility with general binary files, they still face specific challenges when dealing with Wasm.In this paper, we introduce a novel approach, WaDec, which is the first use of a fine-tuned LLM to interpret and decompile Wasm binary code into a higher-level, more comprehensible source code representation. The LLM was meticulously fine-tuned using a specialized dataset of wat-c code snippets, employing self-supervised learning techniques. This enables WaDec to effectively decompile not only complete wat functions but also finer-grained wat code snippets. Our experiments demonstrate that WaDec markedly outperforms current state-of-the-art tools, offering substantial improvements across several metrics. It achieves a code inflation rate of only 3.34%, a dramatic 97% reduction compared to the state-of-the-art's 116.94%. Unlike the output of baselines that cannot be directly compiled or executed, WaDec maintains a recompilability rate of 52.11%, a re-execution rate of 43.55%, and an output consistency of 27.15%. Additionally, it significantly exceeds state-of-the-art performance in AST edit distance similarity by 185%, cyclomatic complexity by 8%, and cosine similarity by 41%, achieving an average code similarity above 50%. In summary, WaDec enhances understanding of the code's structure and execution flow, facilitating automated code analysis, optimization, and security auditing.",
    "ENTRYTYPE": "inproceedings",
    "ID": "10.1145/3691620.3695020"
  },
  {
    "year": "2025",
    "url": "https://doi.org/10.1145/3696410.3714790",
    "title": "SuiGPT MAD: Move AI Decompiler to Improve Transparency and Auditability on Non-Open-Source Blockchain Smart Contract",
    "series": "WWW '25",
    "publisher": "Association for Computing Machinery",
    "pages": "1567–1576",
    "numpages": "10",
    "location": "Sydney NSW, Australia",
    "keywords": "auditing tools, large language models, move, prompt engineering, smart contract, sui, transparency, web applications, web3",
    "isbn": "9798400712746",
    "doi": "10.1145/3696410.3714790",
    "booktitle": "Proceedings of the ACM on Web Conference 2025",
    "author": "Chen, Eason and Tang, Xinyi and Xiao, Zimo and Li, Chuangji and Li, Shizhuo and Wu, Tingguan and Wang, Siyun and Chalkias, Kostas Kryptos",
    "address": "New York, NY, USA",
    "abstract": "The vision of Web3 is to improve user control over data and assets, but one challenge that complicates this vision is the prevalence of non-transparent, scam-prone applications and vulnerable smart contracts that put Web3 users at risk. While code audits are one solution to this problem, the lack of smart contracts source code on many blockchain platforms, such as Sui, hinders the ease of auditing. A promising approach to this issue is the use of a decompiler to reverse-engineer smart contract bytecode. However, existing decompilers for Sui produce code that is difficult to understand and cannot be directly recompiled. To address this, we developed the SuiGPT Move AI Decompiler (MAD), a Large Language Model (LLM)-powered web application that decompiles smart contract bytecodes on Sui into logically correct, human-readable, and re-compilable source code with prompt engineering. Our evaluation shows that MAD's output successfully passes original unit tests and achieves a 73.33% recompilation success rate on real-world smart contracts. Additionally, newer models tend to deliver improved performance, suggesting that MAD's approach will become increasingly effective as LLMs continue to advance. In a user study involving 12 developers, we found that MAD significantly reduced the auditing workload compared to using traditional decompilers. Participants found MAD's outputs comparable to the original source code, improving accessibility for understanding and auditing non-open-source smart contracts. Through qualitative interviews with these developers and Web3 projects, we further discussed the strengths and concerns of MAD. MAD has practical implications for blockchain smart contract transparency, auditing, and education. It empowers users to easily and independently review and audit non-open-source smart contracts, fostering accountability and decentralization. Moreover, MAD's methodology could potentially extend to other smart contract languages, like Solidity, further enhancing Web3 transparency.",
    "ENTRYTYPE": "inproceedings",
    "ID": "10.1145/3696410.3714790"
  },
  {
    "year": "2025",
    "volume": "2",
    "url": "https://doi.org/10.1145/3729373",
    "title": "DiSCo: Towards Decompiling EVM Bytecode to Source Code using Large Language Models",
    "publisher": "Association for Computing Machinery",
    "numpages": "24",
    "number": "FSE",
    "month": "June",
    "keywords": "Decompilation, EVM bytecode, Large Language Models, Smart Contract, Source Code Generation",
    "journal": "Proc. ACM Softw. Eng.",
    "issue_date": "July 2025",
    "doi": "10.1145/3729373",
    "author": "Su, Xing and Liang, Hanzhong and Wu, Hao and Niu, Ben and Xu, Fengyuan and Zhong, Sheng",
    "articleno": "FSE103",
    "address": "New York, NY, USA",
    "abstract": "Understanding the Ethereum smart contract bytecode is essential for ensuring cryptoeconomics security. However, existing decompilers primarily convert bytecode into pseudocode, which is not easily comprehensible for general users, potentially leading to misunderstanding of contract behavior and increased vulnerability to scams or exploits. In this paper, we propose DiSCo, the first LLMs-based EVM decompilation pipeline, which aims to enable LLMs to understand the opaque bytecode and lift it into smart contract code. DiSCo introduces three core technologies. First, a logic-invariant intermediate representation is proposed to reproject the low-level bytecode into high-level abstracted units. The second technique involves semantic enhancement based on a novel type-aware graph model to infer stripped variables during compilation, enhancing the lifting effect. The third technology is a flexible method incorporating code specifications to construct LLM-comprehensible prompts for source code generation. Extensive experiments illustrate that our generated code guarantees a high compilability rate at 75%, with differential fuzzing pass rate averaging at 50%. Manual validation results further indicate that the generated solidity contracts significantly outperforms baseline methods in tasks such as code comprehension and attack reproduction.",
    "ENTRYTYPE": "article",
    "ID": "10.1145/3729373"
  },
  {
    "year": "2025",
    "url": "https://doi.org/10.1145/3749988",
    "title": "REMEND: Neural Decompilation for Reverse Engineering Math Equations from Binary Executables",
    "publisher": "Association for Computing Machinery",
    "note": "Just Accepted",
    "month": "July",
    "keywords": "reverse engineering, neural decompilation, math equations",
    "journal": "ACM Trans. Intell. Syst. Technol.",
    "issn": "2157-6904",
    "doi": "10.1145/3749988",
    "author": "Udeshi, Meet and Krishnamurthy, Prashanth and Karri, Ramesh and Khorrami, Farshad",
    "address": "New York, NY, USA",
    "abstract": "Analysis of binary executables implementing mathematical equations can benefit from the reverse engineering of semantic information about the implementation. Traditional algorithmic reverse engineering tools either do not recover semantic information or rely on dynamic analysis and symbolic execution with high reverse engineering time. Algorithmic tools also require significant re-engineering effort to target new platforms and languages. Recently, neural methods for decompilation have been developed to recover human-like source code, but they do not extract semantic information explicitly. We develop REMEND, a neural decompilation framework to reverse engineer math equations from binaries to explicitly recover program semantics like data flow and order of operations. REMEND combines a transformer encoder-decoder model for neural decompilation with algorithmic processing for enhanced symbolic reasoning necessary for math equations. REMEND is the first work to demonstrate that transformers for neural decompilation go beyond source code and reason about program semantics in the form of math equations. We train on a synthetically generated dataset containing multiple implementations and compilations of math equations to produce a robust neural decompilation model and demonstrate retargettability. REMEND obtains an accuracy of 89.8% to 92.4% across three Instruction Set Architectures (ISAs), three optimization levels, and two programming languages with a single trained model, extending the capability of state-of-the-art neural decompilers. We achieve high accuracy with a small model of upto 12 million parameters and an average execution time of 0.132 seconds per function. On a real-world dataset collected from open-source programs, REMEND generalizes better than state-of-the-art neural decompilers despite being trained with synthetic data, achieving 8% higher accuracy. The synthetic and real-world datasets are provided at .",
    "ENTRYTYPE": "article",
    "ID": "10.1145/3749988"
  },
  {
    "year": "2023",
    "volume": "",
    "title": "Revisiting Deep Learning for Variable Type Recovery",
    "pages": "275-279",
    "number": "",
    "month": "May",
    "keywords": "Training;Source coding;Semantics;Reverse engineering;Symbols;Computer architecture;Static analysis;Ghidra;Hex-Rays;Machine Learning;Transformers",
    "issn": "2643-7171",
    "doi": "10.1109/ICPC58990.2023.00042",
    "booktitle": "2023 IEEE/ACM 31st International Conference on Program Comprehension (ICPC)",
    "author": "Cao, Kevin and Leach, Kevin",
    "abstract": "Compiled binary executables are often the only available artifact in reverse engineering, malware analysis, and software systems maintenance. Unfortunately, the lack of semantic information like variable types makes comprehending binaries difficult. In efforts to improve the comprehensibility of binaries, researchers have recently used machine learning techniques to predict semantic information contained in the original source code. Chen et al. implemented DIRTY, a Transformer-based Encoder-Decoder architecture capable of augmenting decompiled code with variable names and types by leveraging decompiler output tokens and variable size information. Chen et al. were able to demonstrate a substantial increase in name and type extraction accuracy on Hex-Rays decompiler outputs compared to existing static analysis and AI-based techniques. We extend the original DIRTY results by re-training the DIRTY model on a dataset produced by the open-source Ghidra decompiler. Although Chen et al. concluded that Ghidra was not a suitable decompiler candidate due to its difficulty in parsing and incorporating DWARF symbols during analysis, we demonstrate that straightforward parsing of variable data generated by Ghidra results in similar retyping performance. We hope this work inspires further interest and adoption of the Ghidra decompiler for use in research projects.",
    "ENTRYTYPE": "inproceedings",
    "ID": "10174218"
  },
  {
    "year": "2024",
    "volume": "",
    "title": "GREMC: Genetic Reverse-Engineering of Machine Code to Search Vulnerabilities in Software for Industry 4.0. Predicting the Size of the Decompiling Source Code",
    "pages": "622-628",
    "number": "",
    "month": "March",
    "keywords": "Codes;Source coding;Reverse engineering;Prototypes;Production;Genetics;Software;machine code;source code;reverse-engineering;decompilation;size dependence",
    "issn": "",
    "doi": "10.1109/SmartIndustryCon61328.2024.10515515",
    "booktitle": "2024 International Russian Smart Industry Conference (SmartIndustryCon)",
    "author": "Izrailov, Konstantin",
    "abstract": "The article is devoted to the problem of security of cyber-physical systems as part of production according to the Industry 4.0 concept. For this purpose, the author's approach of “Genetic Reverse Engineering of Machine Code” (GREMC) is proposed. The essence of this approach lies in the use of artificial intelligence in the field of genetic algorithms to restore the source code of software executed in the form of machine code on cyber-physical devices for Industry 4.0. The resulting code can then be analysed for vulnerabilities by an expert. One issue that arises during genetic reverse engineering is predicting the size of the source code based on its machine representation (i.e., in an object or executable file). The article is devoted to solving this problem for functions in the C programming language. To do this, a method for obtaining a relationship between the sizes of the source and machine code of individual functions is described, which consists of steps such as loading a dataset with C-functions, isolating the function code in it, preprocessing them, compiling them into machine code, calculating the required sizes, building dependencies between each source code size and the corresponding machine code sizes, generating the final table and determining the dependency formula. An experiment is carried out using a software prototype that implements the method; ExeBench with 83 thousand C-functions is taken as a dataset. Justifications are given regarding the appearance of abnormal machine code sizes and their impact on the dependence formula.",
    "ENTRYTYPE": "inproceedings",
    "ID": "10515515"
  },
  {
    "year": "2024",
    "volume": "",
    "title": "\"Len or index or count, anything but v1\": Predicting Variable Names in Decompilation Output with Transfer Learning",
    "pages": "4069-4087",
    "number": "",
    "month": "May",
    "keywords": "Training;Privacy;Codes;Source coding;Transfer learning;Reverse engineering;Transformers;Program and binary analysis;Machine learning and computer security;Decompilation",
    "issn": "2375-1207",
    "doi": "10.1109/SP54263.2024.00152",
    "booktitle": "2024 IEEE Symposium on Security and Privacy (SP)",
    "author": "Pal, Kuntal Kumar and Bajaj, Ati Priya and Banerjee, Pratyay and Dutcher, Audrey and Nakamura, Mutsumi and Basque, Zion Leonahenahe and Gupta, Himanshu and Sawant, Saurabh Arjun and Anantheswaran, Ujjwala and Shoshitaishvili, Yan and Doupé, Adam and Baral, Chitta and Wang, Ruoyu",
    "abstract": "Binary reverse engineering is an arduous and tedious task performed by skilled and expensive human analysts. Information about the source code is irrevocably lost in the compilation process. While modern decompilers attempt to generate C-style source code from a binary, they cannot recover lost variable names. Prior works have explored machine learning techniques for predicting variable names in decompiled code. However, the state-of-the-art systems, DIRE and DIRTY, generalize poorly to functions in the testing set that are not included in the training set—31.8% for DIRE on DIRTY’s data set and 36.9% for DIRTY on DIRTY’s data set.In this paper, we present VarBERT, a Bidirectional Encoder Representations from Transformers (BERT) to predict meaningful variable names in decompilation output. An advantage of VarBERT is that we can pre-train on human source code and then fine-tune the model to the task of predicting variable names. We also create a new data set VarCorpus, which significantly expands the size and variety of the data set. Our evaluation of VarBERT on VarCorpus, demonstrates a significant improvement in predicting the developer’s original variable names for O2 optimized binaries achieving accuracies of 54.43% for IDA and 54.49% for Ghidra. VarBERT is strictly better than state-of-the-art techniques: On a subset of VarCorpus, VarBERT could predict the developer’s original variable names 50.70% of the time, while DIRE and DIRTY predicted original variable names 35.94% and 38.00% of the time, respectively.",
    "ENTRYTYPE": "inproceedings",
    "ID": "10646727"
  },
  {
    "year": "2025",
    "volume": "",
    "title": "PyLingual: Toward Perfect Decompilation of Evolving High-Level Languages",
    "pages": "2976-2994",
    "number": "",
    "month": "May",
    "keywords": "Codes;Translation;Program processors;Source coding;Semantics;Reverse engineering;Syntactics;Natural language processing;Security;Python;python;decompiler;nlp;reverse engineering",
    "issn": "2375-1207",
    "doi": "10.1109/SP61157.2025.00052",
    "booktitle": "2025 IEEE Symposium on Security and Privacy (SP)",
    "author": "Wiedemeier, Josh and Tarbet, Elliot and Zheng, Max and Ko, Sangsoo and Ouyang, Jessica and Cha, Sang Kil and Jee, Kangkook",
    "abstract": "Python is one of the most popular programming languages among both industry developers and malware authors. Despite demand for Python decompilers, community efforts to maintain automatic Python decompilation tools have been hindered by Python's aggressive language improvements and unstable bytecode specification. Every year, language features are added, code generation undergoes significant changes, and opcodes are added, deleted, and modified. Our research aims to integrate Natural Language Processing (NLP) techniques with classical Programming Language (PL) theory to create a Python decompiler that accomodates evolving language features and changes to the bytecode specification with minimal human maintenance effort. PyLINGUAL plugs in data-driven NLP components to a version-agnostic core to automatically absorb superficial bytecode and compiler changes, while leveraging programmatic components for abstract control flow reconstruction. To establish trust in the decompilation results, we introduce a stringent correctness measure based on “perfect decompilation”, a statically verifiable refinement of semantic equivalence. We demonstrate the efficacy of our approach with extensive real-world datasets of benign and malicious Python source code and their corresponding compiled PYC binaries. Our research makes three major contributions: (1) we present PyLINGUAL, a scalable, data-driven decompilation framework with state-of-the-art support for Python versions 3.6 through 3.12, improving the perfect decompilation rate by an average of 45% over the best results of existing decompiler across four datasets; (2) we provide a Python decompiler evaluation framework that verifies decompilation results with perfect decompilation; and (3) we launch PyLINGUAL as a public online service.",
    "ENTRYTYPE": "inproceedings",
    "ID": "11023256"
  },
  {
    "year": "2025",
    "volume": "",
    "title": "TypeForge: Synthesizing and Selecting Best-Fit Composite Data Types for Stripped Binaries",
    "pages": "1-18",
    "number": "",
    "month": "May",
    "keywords": "Privacy;Codes;Accuracy;Scalability;Reverse engineering;Layout;Buildings;Software;Security;Flow graphs",
    "issn": "2375-1207",
    "doi": "10.1109/SP61157.2025.00193",
    "booktitle": "2025 IEEE Symposium on Security and Privacy (SP)",
    "author": "Wang, Yanzhong and Liang, Ruigang and Li, Yilin and Hu, Peiwei and Chen, Kai and Zhang, Bolun",
    "abstract": "Static binary analysis is a widely used approach for ensuring the security of closed-source software. However, the absence of type information in stripped binaries, particularly for composite data types, poses significant challenges for both static analyzers and reverse engineering experts in achieving efficient and accurate analysis. Existing methods often struggle with inaccuracies and scalability limitations when dealing with such data types. To address these problems, we present Typeforge, a novel approach inspired by the workflow of reverse engineering experts, which uses a two-stage synthesis-selection strategy to automate the recovery of composite data types from stripped binaries. We design a new graph structure, the Type Flow Graph (TFG) to represent type information within stripped binaries. In the first stage, TFG-based Type Synthesis focuses on efficiently and accurately building constraints and synthesizing possible composite type declarations from the stripped binaries. In the second stage, we propose an LLM-assisted double-elimination framework to select the best-fit type declaration from the candidates by assessing the readability of the decompiled code. Our comparison with state-of-the-art approaches demonstrates that TYPEFORGE achieves F1 scores of 81.7% and 88.2% in Composite Data Type Identification and Layout Recovery, respectively, substantially outperforming existing methods. Additionally, TYPEFORGE achieves an F1 score of 72.1% in Relationship Recovery, a particularly challenging task for previous approaches. Furthermore, TYPEFORGE has significantly lower time overhead, requiring only about 3.8% of the time taken by OSPREY, the best-performing existing approach, making it a promising solution for various real-world reverse engineering tasks.",
    "ENTRYTYPE": "inproceedings",
    "ID": "11023499"
  },
  {
    "year": "2025",
    "volume": "",
    "title": "Reengineering Modern Industrial Software to Find Vulnerabilities Based on Genetic Algorithms",
    "pages": "918-923",
    "number": "",
    "month": "May",
    "keywords": "Industries;Source coding;Instruments;Reverse engineering;Software algorithms;Information security;Genetics;Software systems;Manufacturing;Genetic algorithms;software;vulnerability;information security;reverse engineering;genetic algorithms",
    "issn": "2993-4060",
    "doi": "10.1109/ICIEAM65163.2025.11028410",
    "booktitle": "2025 International Conference on Industrial Engineering, Applications and Manufacturing (ICIEAM)",
    "author": "Izrailov, Konstantin and Kotenko, Igor and Buinevich, Mikhail",
    "abstract": "Modern industry is built, among other things, on software, the presence of vulnerabilities in which is a significant problem. It is more rational to search for vulnerabilities in those representations of the program (source code, algorithms, architecture, etc.) on the basis of which they were developed. However, as a rule, there is difficult-to-analyze machine code available. Obtaining higher-level representations is possible by reverse engineering, carried out in various ways, such as expert, algorithmic, intelligent, enumeration and logging. The qualitative comparison of these representations is given. The current study is devoted to a new method of reverse engineering based on the use of genetic algorithms. The course of the research and the following main scientific results are briefly described: the methodology of reverse engineering of a software system, the model of the life cycle of a program with multi-level vulnerabilities, the concept of genetic de-evolution of program representations, scientific, methodological and algorithmic instrumentation for genetic decompilation, an architectural block for conducting genetic de-evolution of representations with functionality for searching for multi-level vulnerabilities. All results are novel, as well as theoretically and practically significant.",
    "ENTRYTYPE": "inproceedings",
    "ID": "11028410"
  },
  {
    "year": "2025",
    "volume": "",
    "title": "Enhancing LLM to Decompile Optimized PTX to Readable CUDA for Tensor Programs",
    "pages": "2235-2247",
    "number": "",
    "month": "Nov",
    "keywords": "Codes;Tensors;Accuracy;Graphics processing units;Training data;Data augmentation;Complexity theory;Kernel;Optimization;Tuning;LLM;Decompilation;Deep learning compiler;GPU Programming",
    "issn": "2643-1572",
    "doi": "10.1109/ASE63991.2025.00185",
    "booktitle": "2025 40th IEEE/ACM International Conference on Automated Software Engineering (ASE)",
    "author": "Sun, Xinyu and Tang, Fugen and Zhang, Yu and Shen, Han and Song, Chengru and Zhang, Di",
    "abstract": "The growing demand for high-performance tensor programs on GPUs, especially for large language models (LLMs), necessitates advanced compilation and optimization techniques. However, the critical task of analyzing optimized, low-level PTX code for performance tuning or understanding poses significant challenges. While LLMs hold promise for PTX-to-CUDA de-compilation to improve code intelligibility, their effectiveness is severely limited by the scarcity of aligned training data and the inherent complexity of highly optimized, unrolled PTX code.In this work, we explore methodologies to significantly enhance LLM capabilities for accurate and readable PTX-to-CUDA decompilation and present PtxDec, a decompilation prototype implementing our approach. To overcome the critical barrier of data scarcity, we develop a compiler-based data augmentation framework coupled with rigorous post-processing, enabling the creation of a large-scale, high-quality dataset of 400K aligned CUDA-PTX kernel pairs for effective LLM training. Furthermore, to empower LLMs to handle the complexity of optimized PTX, we introduce Rolled-PTX—an intermediate representation generated through heuristic loop rerolling during preprocessing. Rolled-PTX condenses unrolled patterns, drastically simplifying the input structure presented to the LLM and aligning it better with higher-level loop constructs.Comprehensive evaluation demonstrates that PtxDec achieves substantial performance gains: our approach yields a 2.3×–3.1× improvement in functional accuracy over baseline methods, alongside significant enhancements in generated code readability and scheduling consistency with the original optimized kernels. Ablation studies further validate the contribution of each proposed component to the overall performance.To the best of our knowledge, this is the first work tackling PTX-to-CUDA decompilation, specifically focusing on and demonstrating effective strategies for augmenting LLMs to overcome the key challenges in this domain.",
    "ENTRYTYPE": "inproceedings",
    "ID": "11334294"
  },
  {
    "year": "2025",
    "volume": "",
    "title": "PseudoFix: Refactoring Distorted Structures in Decompiled C Pseudocode",
    "pages": "841-853",
    "number": "",
    "month": "Nov",
    "keywords": "Systematics;Statistical analysis;Large language models;Source coding;Taxonomy;Semantics;Software algorithms;Distortion;Security;Software engineering;Decompilation;Refactor Structure Distortion;Taxonomy;In-context Learning;Large Language Models",
    "issn": "2643-1572",
    "doi": "10.1109/ASE63991.2025.00075",
    "booktitle": "2025 40th IEEE/ACM International Conference on Automated Software Engineering (ASE)",
    "author": "Li, Gangyang and Shang, Xiuwei and Cheng, Shaoyin and Zhang, Junqi and Hu, Li and Zhu, Xu and Zhang, Weiming and Yu, Nenghai",
    "abstract": "Decompilation can convert binary programs into clear C-style pseudocode, which is of great value in a wide range of security applications. Existing research primarily focuses on recovering symbolic information in pseudocode, such as function names, variable names, and data types, but neglecting structural information. We observe that even when symbolic information is fully preserved, severe and complex structure distortions remain in the pseudocode, greatly impairing code readability and comprehension. In this work, we first systematically investigate structure distortions in decompiled pseudocode, revealing their variation patterns through quantitative analysis. Using open coding, we derive a taxonomy comprising six top-level categories of structure distortions. Building upon this taxonomy, we propose PseudoFix, a novel framework that combines large language models (LLMs) with retrieval-based in-context learning. PseudoFix employs semantic retrieval to select the most relevant few-shot examples that provide structure distortion knowledge, and combines this with the well-structured coding patterns learned by LLMs from vast source code repositories, to efficiently refactor distorted pseudocode. Comprehensive evaluations demonstrate that PseudoFix significantly improves pseudocode readability, achieving up to a 34% reduction in Halstead Complexity Effort and a 105% increase in BLEU-4 score. Notably, it significantly outperforms state-of-the-art approaches in both temporary variable elimination and goto statement removal tasks. Additionally, human evaluations yield consistently positive feedback from users across readability, consistency, and reasonability.",
    "ENTRYTYPE": "inproceedings",
    "ID": "11334626"
  },
  {
    "year": "2026",
    "volume": "",
    "title": "DECodeT5: A Lightweight and Efficient Neural Decompiler with Assembly Semantic Assistance",
    "pages": "1-1",
    "number": "",
    "month": "",
    "keywords": "Codes;Semantics;Assembly;Source coding;Optimization;Instruction sets;Computer architecture;Adaptation models;Microprogramming;Internet of Things;Decompile;reverse engineering;firmware security;deep neural network",
    "journal": "IEEE Internet of Things Journal",
    "issn": "2327-4662",
    "doi": "10.1109/JIOT.2026.3659328",
    "author": "Liu, Li and Sun, Fanghui and Wang, Shen and Jiang, Xunzhi",
    "abstract": "Decompilation plays a critical role in firmware analysis and reverse engineering by enabling the recovery of high-level source code from binary executables. However, existing neural decompilation models often face challenges due to the semantic gap between assembly code and high-level languages, and they typically require large-scale models that impose significant computational demands. In this paper, we propose DECodeT5, a lightweight and efficient neural decompilation method for the C language. DECodeT5 builds upon the CodeT5 code generation model by integrating a pre-trained assembly encoder in place of its original embedding layer. This modification allows for more effective semantic learning from assembly code, improving the model’s ability to capture the intricacies of assembly-to-source code mapping. The architecture of DECodeT5 not only accelerates convergence during end-to-end decompilation tasks but also supports rapid adaptation across different compilers and instruction set architectures (ISAs) by swapping out the encoder module as needed. Our experimental evaluation on the HumanEval and Exebench benchmarks reveals that DECodeT5 significantly improves semantic recovery accuracy, outperforming Ghidra by over 83% and LLM4Decompile by more than 43% in terms of execution recovery. Furthermore, DECodeT5 maintains a compact model size of only 360M parameters, providing inference speeds that are twice as fast as LLM4Decompile. These results underscore DECodeT5’s suitability for deployment in resource-constrained environments and its flexibility in adapting to real-world reverse engineering scenarios, offering a practical solution for modern firmware analysis and security tasks.",
    "ENTRYTYPE": "article",
    "ID": "11367734"
  },
  {
    "year": "2018",
    "volume": "",
    "title": "Using recurrent neural networks for decompilation",
    "pages": "346-356",
    "number": "",
    "month": "March",
    "keywords": "Recurrent neural networks;Tools;Training;Binary codes;Natural languages;Decoding;Data models;decompilation;recurrent neural networks;translation;deep learning",
    "issn": "",
    "doi": "10.1109/SANER.2018.8330222",
    "booktitle": "2018 IEEE 25th International Conference on Software Analysis, Evolution and Reengineering (SANER)",
    "author": "Katz, Deborah S. and Ruchti, Jason and Schulte, Eric",
    "abstract": "Decompilation, recovering source code from binary, is useful in many situations where it is necessary to analyze or understand software for which source code is not available. Source code is much easier for humans to read than binary code, and there are many tools available to analyze source code. Existing decompilation techniques often generate source code that is difficult for humans to understand because the generated code often does not use the coding idioms that programmers use. Differences from human-written code also reduce the effectiveness of analysis tools on the decompiled source code. To address the problem of differences between decompiled code and human-written code, we present a novel technique for decompiling binary code snippets using a model based on Recurrent Neural Networks. The model learns properties and patterns that occur in source code and uses them to produce decompilation output. We train and evaluate our technique on snippets of binary machine code compiled from C source code. The general approach we outline in this paper is not language-specific and requires little or no domain knowledge of a language and its properties or how a compiler operates, making the approach easily extensible to new languages and constructs. Furthermore, the technique can be extended and applied in situations to which traditional decompilers are not targeted, such as for decompilation of isolated binary snippets; fast, on-demand decompilation; domain-specific learned decompilation; optimizing for readability of decompilation; and recovering control flow constructs, comments, and variable or function names. We show that the translations produced by this technique are often accurate or close and can provide a useful picture of the snippet's behavior.",
    "ENTRYTYPE": "inproceedings",
    "ID": "8330222"
  },
  {
    "year": "2026",
    "title": "HELIOS: Hierarchical Graph Abstraction for Structure-Aware LLM Decompilation",
    "note": "",
    "month": "jan",
    "howpublished": "\\url{https://arxiv.org/pdf/2601.14598}",
    "doi": "https://doi.org/10.48550/arXiv.2601.14598",
    "author": "Achamyeleh, Gizachew, Yonatan AND Thomare, Harsh AND Faruque, Al, Abdullah, Mohammad",
    "abstract": "Large language models (LLMs) have recently been applied to binary decompilation, yet they still treat code as plain text and ignore the graphs that govern program control flow. This limitation often yields syntactically fragile and logically inconsistent output, especially for optimized binaries. This paper presents \\textsc\\{HELIOS\\}, a framework that reframes LLM-based decompilation as a structured reasoning task. \\textsc\\{HELIOS\\} summarizes a binary's control flow and function calls into a hierarchical text representation that spells out basic blocks, their successors, and high-level patterns such as loops and conditionals. This representation is supplied to a general-purpose LLM, along with raw decompiler output, optionally combined with a compiler-in-the-loop that returns error messages when the generated code fails to build. On HumanEval-Decompile for \\texttt\\{x86\\_64\\}, \\textsc\\{HELIOS\\} raises average object file compilability from 45.0\\% to 85.2\\% for Gemini~2.0 and from 71.4\\% to 89.6\\% for GPT-4.1~Mini. With compiler feedback, compilability exceeds 94\\% and functional correctness improves by up to 5.6 percentage points over text-only prompting. Across six architectures drawn from x86, ARM, and MIPS, \\textsc\\{HELIOS\\} reduces the spread in functional correctness while keeping syntactic correctness consistently high, all without fine-tuning. These properties make \\textsc\\{HELIOS\\} a practical building block for reverse engineering workflows in security settings where analysts need recompilable, semantically faithful code across diverse hardware targets. ",
    "ENTRYTYPE": "article",
    "ID": "Achamyeleh2026"
  },
  {
    "year": "2025",
    "url": "https://arxiv.org/abs/2509.14646v1",
    "updated": "2025-09-18T05:57:15Z",
    "title": "SALT4Decompile: Inferring Source-level Abstract Logic Tree for LLM-Based Binary Decompilation",
    "published": "2025-09-18T05:57:15Z",
    "primaryclass": "cs.SE",
    "pdf": "https://arxiv.org/pdf/2509.14646v1",
    "month": "09",
    "journal": "arXiv preprint arXiv:2509.14646",
    "eprint": "2509.14646",
    "comment": "13 pages, 7 figures",
    "categories": "cs.SE cs.PL",
    "author": "Yongpan Wang and Xin Xu and Xiaojie Zhu and Xiaodong Gu and Beijun Shen",
    "archiveprefix": "arXiv",
    "abstract": "Decompilation is widely used in reverse engineering to recover high-level language code from binary executables. While recent approaches leveraging Large Language Models (LLMs) have shown promising progress, they typically treat assembly code as a linear sequence of instructions, overlooking arbitrary jump patterns and isolated data segments inherent to binary files. This limitation significantly hinders their ability to correctly infer source code semantics from assembly code. To address this limitation, we propose \\\\saltm, a novel binary decompilation method that abstracts stable logical features shared between binary and source code. The core idea of \\\\saltm is to abstract selected binary-level operations, such as specific jumps, into a high-level logic framework that better guides LLMs in semantic recovery. Given a binary function, \\\\saltm constructs a Source-level Abstract Logic Tree (\\\\salt) from assembly code to approximate the logic structure of high-level language. It then fine-tunes an LLM using the reconstructed \\\\salt to generate decompiled code. Finally, the output is refined through error correction and symbol recovery to improve readability and correctness. We compare \\\\saltm to three categories of baselines (general-purpose LLMs, commercial decompilers, and decompilation methods) using three well-known datasets (Decompile-Eval, MBPP, Exebench). Our experimental results demonstrate that \\\\saltm is highly effective in recovering the logic of the source code, significantly outperforming state-of-the-art methods (e.g., 70.4\\\\\\% TCP rate on Decompile-Eval with a 10.6\\\\\\% improvement). The results further validate its robustness against four commonly used obfuscation techniques. Additionally, analyses of real-world software and a user study confirm that our decompiled output offers superior assistance to human analysts in comprehending binary functions.",
    "ENTRYTYPE": "article",
    "ID": "arXiv:2509.14646"
  },
  {
    "year": "2021",
    "title": "Variable Name Recovery in Decompiled Binary Code using Constrained Masked Language Modeling",
    "note": "Work In Progress",
    "month": "mar",
    "howpublished": "\\url{https://arxiv.org/pdf/2103.12801}",
    "doi": "https://doi.org/10.48550/arXiv.2103.12801",
    "author": "Banerjee, Pratyay AND Pal, Kumar, Kuntal AND Wang, Fish AND Baral, Chitta",
    "abstract": "Decompilation is the procedure of transforming binary programs into a high-level representation, such as source code, for human analysts to examine. While modern decompilers can reconstruct and recover much information that is discarded during compilation, inferring variable names is still extremely difficult. Inspired by recent advances in natural language processing, we propose a novel solution to infer variable names in decompiled code based on Masked Language Modeling, Byte-Pair Encoding, and neural architectures such as Transformers and BERT. Our solution takes \\textit\\{raw\\} decompiler output, the less semantically meaningful code, as input, and enriches it using our proposed \\textit\\{finetuning\\} technique, Constrained Masked Language Modeling. Using Constrained Masked Language Modeling introduces the challenge of predicting the number of masked tokens for the original variable name. We address this \\textit\\{count of token prediction\\} challenge with our post-processing algorithm. Compared to the state-of-the-art approaches, our trained VarBERT model is simpler and of much better performance. We evaluated our model on an existing large-scale data set with 164,632 binaries and showed that it can predict variable names identical to the ones present in the original source code up to 84.15\\% of the time. ",
    "ENTRYTYPE": "article",
    "ID": "Banerjee2021"
  },
  {
    "year": "2023",
    "title": "Boosting Neural Networks to Decompile Optimized Binaries",
    "note": "",
    "month": "jan",
    "howpublished": "\\url{https://arxiv.org/pdf/2301.00969}",
    "doi": "https://doi.org/10.48550/arXiv.2301.00969",
    "author": "Cao, Ying AND Liang, Ruigang AND Chen, Kai AND Hu, Peiwei",
    "abstract": "Decompilation aims to transform a low-level program language (LPL) (eg., binary file) into its functionally-equivalent high-level program language (HPL) (e.g., C/C++). It is a core technology in software security, especially in vulnerability discovery and malware analysis. In recent years, with the successful application of neural machine translation (NMT) models in natural language processing (NLP), researchers have tried to build neural decompilers by borrowing the idea of NMT. They formulate the decompilation process as a translation problem between LPL and HPL, aiming to reduce the human cost required to develop decompilation tools and improve their generalizability. However, state-of-the-art learning-based decompilers do not cope well with compiler-optimized binaries. Since real-world binaries are mostly compiler-optimized, decompilers that do not consider optimized binaries have limited practical significance. In this paper, we propose a novel learning-based approach named NeurDP, that targets compiler-optimized binaries. NeurDP uses a graph neural network (GNN) model to convert LPL to an intermediate representation (IR), which bridges the gap between source code and optimized binary. We also design an Optimized Translation Unit (OTU) to split functions into smaller code fragments for better translation performance. Evaluation results on datasets containing various types of statements show that NeurDP can decompile optimized binaries with 45.21% higher accuracy than state-of-the-art neural decompilation frameworks. ",
    "ENTRYTYPE": "article",
    "ID": "Cao2023"
  },
  {
    "year": "2021",
    "title": "Augmenting Decompiler Output with Learned Variable Names and Types",
    "note": "17 pages to be published in USENIX Security '22",
    "month": "aug",
    "howpublished": "\\url{https://arxiv.org/pdf/2108.06363}",
    "doi": "https://doi.org/10.48550/arXiv.2108.06363",
    "author": "Chen, Qibin AND Lacomis, Jeremy AND Schwartz, J., Edward AND Goues, Le, Claire AND Neubig, Graham AND Vasilescu, Bogdan",
    "abstract": "A common tool used by security professionals for reverse-engineering binaries found in the wild is the decompiler. A decompiler attempts to reverse compilation, transforming a binary to a higher-level language such as C. High-level languages ease reasoning about programs by providing useful abstractions such as loops, typed variables, and comments, but these abstractions are lost during compilation. Decompilers are able to deterministically reconstruct structural properties of code, but comments, variable names, and custom variable types are technically impossible to recover. In this paper we present DIRTY (DecompIled variable ReTYper), a novel technique for improving the quality of decompiler output that automatically generates meaningful variable names and types. Empirical evaluation on a novel dataset of C code mined from GitHub shows that DIRTY outperforms prior work approaches by a sizable margin, recovering the original names written by developers 66.4% of the time and the original types 75.8% of the time. ",
    "ENTRYTYPE": "article",
    "ID": "Chen2021"
  },
  {
    "year": "2024",
    "title": "VulCatch: Enhancing Binary Vulnerability Detection through CodeT5 Decompilation and KAN Advanced Feature Extraction",
    "note": "",
    "month": "aug",
    "howpublished": "\\url{https://arxiv.org/pdf/2408.07181}",
    "doi": "https://doi.org/10.48550/arXiv.2408.07181",
    "author": "Chukkol, Adama, Hamman, Abdulrahman AND Luo, Senlin AND Sharif, Kashif AND Haruna, Yunusa AND Abdullahi, Muhammad, Muhammad",
    "abstract": "Binary program vulnerability detection is critical for software security, yet existing deep learning approaches often rely on source code analysis, limiting their ability to detect unknown vulnerabilities. To address this, we propose VulCatch, a binary-level vulnerability detection framework. VulCatch introduces a Synergy Decompilation Module (SDM) and Kolmogorov-Arnold Networks (KAN) to transform raw binary code into pseudocode using CodeT5, preserving high-level semantics for deep analysis with tools like Ghidra and IDA. KAN further enhances feature transformation, enabling the detection of complex vulnerabilities. VulCatch employs word2vec, Inception Blocks, BiLSTM Attention, and Residual connections to achieve high detection accuracy (98.88%) and precision (97.92%), while minimizing false positives (1.56%) and false negatives (2.71%) across seven CVE datasets. ",
    "ENTRYTYPE": "article",
    "ID": "Chukkol2024"
  },
  {
    "year": "2025",
    "title": "Decompiling Smart Contracts with a Large Language Model",
    "note": "",
    "month": "jun",
    "howpublished": "\\url{https://arxiv.org/pdf/2506.19624}",
    "doi": "https://doi.org/10.48550/arXiv.2506.19624",
    "author": "David, Isaac AND Zhou, Liyi AND Song, Dawn AND Gervais, Arthur AND Qin, Kaihua",
    "abstract": "The widespread lack of broad source code verification on blockchain explorers such as Etherscan, where despite 78,047,845 smart contracts deployed on Ethereum (as of May 26, 2025), a mere 767,520 (< 1%) are open source, presents a severe impediment to blockchain security. This opacity necessitates the automated semantic analysis of on-chain smart contract bytecode, a fundamental research challenge with direct implications for identifying vulnerabilities and understanding malicious behavior. Prevailing decompilers struggle to reverse bytecode in a readable manner, often yielding convoluted code that critically hampers vulnerability analysis and thwarts efforts to dissect contract functionalities for security auditing. This paper addresses this challenge by introducing a pioneering decompilation pipeline that, for the first time, successfully leverages Large Language Models (LLMs) to transform Ethereum Virtual Machine (EVM) bytecode into human-readable and semantically faithful Solidity code. Our novel methodology first employs rigorous static program analysis to convert bytecode into a structured three-address code (TAC) representation. This intermediate representation then guides a Llama-3.2-3B model, specifically fine-tuned on a comprehensive dataset of 238,446 TAC-to-Solidity function pairs, to generate high-quality Solidity. This approach uniquely recovers meaningful variable names, intricate control flow, and precise function signatures. Our extensive empirical evaluation demonstrates a significant leap beyond traditional decompilers, achieving an average semantic similarity of 0.82 with original source and markedly superior readability. The practical viability and effectiveness of our research are demonstrated through its implementation in a publicly accessible system, available at https://evmdecompiler.com. ",
    "ENTRYTYPE": "article",
    "ID": "David2025"
  },
  {
    "year": "2024",
    "title": "StackSight: Unveiling WebAssembly through Large Language Models and Neurosymbolic Chain-of-Thought Decompilation",
    "note": "9 pages. In the Proceedings of the 41st International Conference on Machine Learning (ICML' 24)",
    "month": "jun",
    "howpublished": "\\url{https://arxiv.org/pdf/2406.04568}",
    "doi": "https://doi.org/10.48550/arXiv.2406.04568",
    "author": "Fang, Weike AND Zhou, Zhejian AND He, Junzhou AND Wang, Weihang",
    "abstract": "WebAssembly enables near-native execution in web applications and is increasingly adopted for tasks that demand high performance and robust security. However, its assembly-like syntax, implicit stack machine, and low-level data types make it extremely difficult for human developers to understand, spurring the need for effective WebAssembly reverse engineering techniques. In this paper, we propose StackSight, a novel neurosymbolic approach that combines Large Language Models (LLMs) with advanced program analysis to decompile complex WebAssembly code into readable C++ snippets. StackSight visualizes and tracks virtual stack alterations via a static analysis algorithm and then applies chain-of-thought prompting to harness LLM's complex reasoning capabilities. Evaluation results show that StackSight significantly improves WebAssembly decompilation. Our user study also demonstrates that code snippets generated by StackSight have significantly higher win rates and enable a better grasp of code semantics. ",
    "ENTRYTYPE": "article",
    "ID": "Fang2024"
  },
  {
    "year": "2024",
    "title": "Self-Constructed Context Decompilation with Fined-grained Alignment Enhancement",
    "note": "EMNLP 2024 Findings",
    "month": "oct",
    "howpublished": "\\url{https://arxiv.org/pdf/2406.17233}",
    "doi": "https://doi.org/10.48550/arXiv.2406.17233",
    "author": "Feng, Yunlong AND Teng, Dechuan AND Xu, Yang AND Mu, Honglin AND Xu, Xiao AND Qin, Libo AND Zhu, Qingfu AND Che, Wanxiang",
    "abstract": "Decompilation transforms compiled code back into a high-level programming language for analysis when source code is unavailable. Previous work has primarily focused on enhancing decompilation performance by increasing the scale of model parameters or training data for pre-training. Based on the characteristics of the decompilation task, we propose two methods: (1) Without fine-tuning, the Self-Constructed Context Decompilation (sc$^2$dec) method recompiles the LLM's decompilation results to construct pairs for in-context learning, helping the model improve decompilation performance. (2) Fine-grained Alignment Enhancement (FAE), which meticulously aligns assembly code with source code at the statement level by leveraging debugging information, is employed during the fine-tuning phase to achieve further improvements in decompilation. By integrating these two methods, we achieved a Re-Executability performance improvement of approximately 3.90% on the Decompile-Eval benchmark, establishing a new state-of-the-art performance of 52.41%. The code, data, and models are available at https://github.com/AlongWY/sccdec. ",
    "ENTRYTYPE": "article",
    "ID": "Feng2024"
  },
  {
    "year": "2025",
    "title": "ReF Decompile: Relabeling and Function Call Enhanced Decompile",
    "note": "",
    "month": "feb",
    "howpublished": "\\url{https://arxiv.org/pdf/2502.12221}",
    "doi": "https://doi.org/10.48550/arXiv.2502.12221",
    "author": "Feng, Yunlong AND Li, Bohan AND Shi, Xiaoming AND Zhu, Qingfu AND Che, Wanxiang",
    "abstract": "The goal of decompilation is to convert compiled low-level code (e.g., assembly code) back into high-level programming languages, enabling analysis in scenarios where source code is unavailable. This task supports various reverse engineering applications, such as vulnerability identification, malware analysis, and legacy software migration. The end-to-end decompile method based on large langauge models (LLMs) reduces reliance on additional tools and minimizes manual intervention due to its inherent properties. However, previous end-to-end methods often lose critical information necessary for reconstructing control flow structures and variables when processing binary files, making it challenging to accurately recover the program's logic. To address these issues, we propose the \\textbf\\{ReF Decompile\\} method, which incorporates the following innovations: (1) The Relabelling strategy replaces jump target addresses with labels, preserving control flow clarity. (2) The Function Call strategy infers variable types and retrieves missing variable information from binary files. Experimental results on the Humaneval-Decompile Benchmark demonstrate that ReF Decompile surpasses comparable baselines and achieves state-of-the-art (SOTA) performance of $61.43\\%$. ",
    "ENTRYTYPE": "article",
    "ID": "Feng2025"
  },
  {
    "year": "2019",
    "title": "A Neural-based Program Decompiler",
    "note": "",
    "month": "jun",
    "howpublished": "\\url{https://arxiv.org/pdf/1906.12029}",
    "doi": "https://doi.org/10.48550/arXiv.1906.12029",
    "author": "Fu, Cheng AND Chen, Huili AND Liu, Haolan AND Chen, Xinyun AND Tian, Yuandong AND Koushanfar, Farinaz AND Zhao, Jishen",
    "abstract": "Reverse engineering of binary executables is a critical problem in the computer security domain. On the one hand, malicious parties may recover interpretable source codes from the software products to gain commercial advantages. On the other hand, binary decompilation can be leveraged for code vulnerability analysis and malware detection. However, efficient binary decompilation is challenging. Conventional decompilers have the following major limitations: (i) they are only applicable to specific source-target language pair, hence incurs undesired development cost for new language tasks; (ii) their output high-level code cannot effectively preserve the correct functionality of the input binary; (iii) their output program does not capture the semantics of the input and the reversed program is hard to interpret. To address the above problems, we propose Coda, the first end-to-end neural-based framework for code decompilation. Coda decomposes the decompilation task into two key phases: First, Coda employs an instruction type-aware encoder and a tree decoder for generating an abstract syntax tree (AST) with attention feeding during the code sketch generation stage. Second, Coda then updates the code sketch using an iterative error correction machine guided by an ensembled neural error predictor. By finding a good approximate candidate and then fixing it towards perfect, Coda achieves superior performance compared to baseline approaches. We assess Coda's performance with extensive experiments on various benchmarks. Evaluation results show that Coda achieves an average of 82\\% program recovery accuracy on unseen binary samples, where the state-of-the-art decompilers yield 0\\% accuracy. Furthermore, Coda outperforms the sequence-to-sequence model with attention by a margin of 70\\% program accuracy. ",
    "ENTRYTYPE": "article",
    "ID": "Fu2019"
  },
  {
    "year": "2022",
    "title": "Beyond the C: Retargetable Decompilation using Neural Machine Translation",
    "note": "",
    "month": "dec",
    "howpublished": "\\url{https://arxiv.org/pdf/2212.08950}",
    "doi": "https://doi.org/10.48550/arXiv.2212.08950",
    "author": "Hosseini, Iman AND Dolan-Gavitt, Brendan",
    "abstract": "The problem of reversing the compilation process, decompilation, is an important tool in reverse engineering of computer software. Recently, researchers have proposed using techniques from neural machine translation to automate the process in decompilation. Although such techniques hold the promise of targeting a wider range of source and assembly languages, to date they have primarily targeted C code. In this paper we argue that existing neural decompilers have achieved higher accuracy at the cost of requiring language-specific domain knowledge such as tokenizers and parsers to build an abstract syntax tree (AST) for the source language, which increases the overhead of supporting new languages. We explore a different tradeoff that, to the extent possible, treats the assembly and source languages as plain text, and show that this allows us to build a decompiler that is easily retargetable to new languages. We evaluate our prototype decompiler, Beyond The C (BTC), on Go, Fortran, OCaml, and C, and examine the impact of parameters such as tokenization and training data selection on the quality of decompilation, finding that it achieves comparable decompilation results to prior work in neural decompilation with significantly less domain knowledge. We will release our training data, trained decompilation models, and code to help encourage future research into language-agnostic decompilation. ",
    "ENTRYTYPE": "article",
    "ID": "Hosseini2022"
  },
  {
    "year": "2025",
    "title": "Nova: Generative Language Models for Assembly Code with Hierarchical Attention and Contrastive Learning",
    "note": "Published as a conference paper at ICLR 2025",
    "month": "nov",
    "howpublished": "\\url{https://arxiv.org/pdf/2311.13721}",
    "doi": "https://doi.org/10.48550/arXiv.2311.13721",
    "author": "Jiang, Nan AND Wang, Chengxiao AND Liu, Kevin AND Xu, Xiangzhe AND Tan, Lin AND Zhang, Xiangyu AND Babkin, Petr",
    "abstract": "Binary code analysis is the foundation of crucial tasks in the security domain; thus building effective binary analysis techniques is more important than ever. Large language models (LLMs) although have brought impressive improvement to source code tasks, do not directly generalize to assembly code due to the unique challenges of assembly: (1) the low information density of assembly and (2) the diverse optimizations in assembly code. To overcome these challenges, this work proposes a hierarchical attention mechanism that builds attention summaries to capture the semantics more effectively and designs contrastive learning objectives to train LLMs to learn assembly optimization. Equipped with these techniques, this work develops Nova, a generative LLM for assembly code. Nova outperforms existing techniques on binary code decompilation by up to 14.84 -- 21.58% (absolute percentage point improvement) higher Pass@1 and Pass@10, and outperforms the latest binary code similarity detection techniques by up to 6.17% Recall@1, showing promising abilities on both assembly generation and understanding tasks. ",
    "ENTRYTYPE": "article",
    "ID": "Jiang2025"
  },
  {
    "year": "2025",
    "title": "Nova: Generative Language Models for Assembly Code with Hierarchical Attention and Contrastive Learning",
    "note": "Published as a conference paper at ICLR 2025",
    "month": "nov",
    "howpublished": "\\url{https://arxiv.org/pdf/2311.13721}",
    "doi": "https://doi.org/10.48550/arXiv.2311.13721",
    "author": "Jiang, Nan AND Wang, Chengxiao AND Liu, Kevin AND Xu, Xiangzhe AND Tan, Lin AND Zhang, Xiangyu AND Babkin, Petr",
    "abstract": "Binary code analysis is the foundation of crucial tasks in the security domain; thus building effective binary analysis techniques is more important than ever. Large language models (LLMs) although have brought impressive improvement to source code tasks, do not directly generalize to assembly code due to the unique challenges of assembly: (1) the low information density of assembly and (2) the diverse optimizations in assembly code. To overcome these challenges, this work proposes a hierarchical attention mechanism that builds attention summaries to capture the semantics more effectively and designs contrastive learning objectives to train LLMs to learn assembly optimization. Equipped with these techniques, this work develops Nova, a generative LLM for assembly code. Nova outperforms existing techniques on binary code decompilation by up to 14.84 -- 21.58% (absolute percentage point improvement) higher Pass@1 and Pass@10, and outperforms the latest binary code similarity detection techniques by up to 6.17% Recall@1, showing promising abilities on both assembly generation and understanding tasks. ",
    "ENTRYTYPE": "article",
    "ID": "Jiang2025"
  },
  {
    "year": "2019",
    "title": "Towards Neural Decompilation",
    "note": "",
    "month": "may",
    "howpublished": "\\url{https://arxiv.org/pdf/1905.08325}",
    "doi": "https://doi.org/10.48550/arXiv.1905.08325",
    "author": "Katz, Omer AND Olshaker, Yuval AND Goldberg, Yoav AND Yahav, Eran",
    "abstract": "We address the problem of automatic decompilation, converting a program in low-level representation back to a higher-level human-readable programming language. The problem of decompilation is extremely important for security researchers. Finding vulnerabilities and understanding how malware operates is much easier when done over source code. The importance of decompilation has motivated the construction of hand-crafted rule-based decompilers. Such decompilers have been designed by experts to detect specific control-flow structures and idioms in low-level code and lift them to source level. The cost of supporting additional languages or new language features in these models is very high. We present a novel approach to decompilation based on neural machine translation. The main idea is to automatically learn a decompiler from a given compiler. Given a compiler from a source language S to a target language T , our approach automatically trains a decompiler that can translate (decompile) T back to S . We used our framework to decompile both LLVM IR and x86 assembly to C code with high success rates. Using our LLVM and x86 instantiations, we were able to successfully decompile over 97% and 88% of our benchmarks respectively. ",
    "ENTRYTYPE": "article",
    "ID": "Katz2019"
  },
  {
    "year": "2019",
    "title": "Adabot: Fault-Tolerant Java Decompiler",
    "note": "8 pages",
    "month": "oct",
    "howpublished": "\\url{https://arxiv.org/pdf/1908.06748}",
    "doi": "https://doi.org/10.48550/arXiv.1908.06748",
    "author": "Li, Zhiming AND Wu, Qing AND Qian, Kun",
    "abstract": "Reverse Engineering(RE) has been a fundamental task in software engineering. However, most of the traditional Java reverse engineering tools are strictly rule defined, thus are not fault-tolerant, which pose serious problem when noise and interference were introduced into the system. In this paper, we view reverse engineering as a statistical machine translation task instead of rule-based task, and propose a fault-tolerant Java decompiler based on machine translation models. Our model is based on attention-based Neural Machine Translation (NMT) and Transformer architectures. First, we measure the translation quality on both the redundant and purified datasets. Next, we evaluate the fault-tolerance(anti-noise ability) of our framework on test sets with different unit error probability (UEP). In addition, we compare the suitability of different word segmentation algorithms for decompilation task. Experimental results demonstrate that our model is more robust and fault-tolerant compared to traditional Abstract Syntax Tree (AST) based decompilers. Specifically, in terms of BLEU-4 and Word Error Rate (WER), our performance has reached 94.50% and 2.65% on the redundant test set; 92.30% and 3.48% on the purified test set. ",
    "ENTRYTYPE": "article",
    "ID": "Li2019"
  },
  {
    "year": "2025",
    "title": "Empirical Study of Code Large Language Models for Binary Security Patch Detection",
    "note": "",
    "month": "sep",
    "howpublished": "\\url{https://arxiv.org/pdf/2509.06052}",
    "doi": "https://doi.org/10.48550/arXiv.2509.06052",
    "author": "Li, Qingyuan AND Li, Binchang AND Gao, Cuiyun AND Gao, Shuzheng AND Li, Zongjie",
    "abstract": "Security patch detection (SPD) is crucial for maintaining software security, as unpatched vulnerabilities can lead to severe security risks. In recent years, numerous learning-based SPD approaches have demonstrated promising results on source code. However, these approaches typically cannot be applied to closed-source applications and proprietary systems that constitute a significant portion of real-world software, as they release patches only with binary files, and the source code is inaccessible. Given the impressive performance of code large language models (LLMs) in code intelligence and binary analysis tasks such as decompilation and compilation optimization, their potential for detecting binary security patches remains unexplored, exposing a significant research gap between their demonstrated low-level code understanding capabilities and this critical security task. To address this gap, we construct a large-scale binary patch dataset containing \\textbf\\{19,448\\} samples, with two levels of representation: assembly code and pseudo-code, and systematically evaluate \\textbf\\{19\\} code LLMs of varying scales to investigate their capability in binary SPD tasks. Our initial exploration demonstrates that directly prompting vanilla code LLMs struggles to accurately identify security patches from binary patches, and even state-of-the-art prompting techniques fail to mitigate the lack of domain knowledge in binary SPD within vanilla models. Drawing on the initial findings, we further investigate the fine-tuning strategy for injecting binary SPD domain knowledge into code LLMs through two levels of representation. Experimental results demonstrate that fine-tuned LLMs achieve outstanding performance, with the best results obtained on the pseudo-code representation. ",
    "ENTRYTYPE": "article",
    "ID": "Li2025"
  },
  {
    "year": "2021",
    "title": "Semantics-Recovering Decompilation through Neural Machine Translation",
    "note": "",
    "month": "dec",
    "howpublished": "\\url{https://arxiv.org/pdf/2112.15491}",
    "doi": "https://doi.org/10.48550/arXiv.2112.15491",
    "author": "Liang, Ruigang AND Cao, Ying AND Hu, Peiwei AND He, Jinwen AND Chen, Kai",
    "abstract": "Decompilation transforms low-level program languages (PL) (e.g., binary code) into high-level PLs (e.g., C/C++). It has been widely used when analysts perform security analysis on software (systems) whose source code is unavailable, such as vulnerability search and malware analysis. However, current decompilation tools usually need lots of experts' efforts, even for years, to generate the rules for decompilation, which also requires long-term maintenance as the syntax of high-level PL or low-level PL changes. Also, an ideal decompiler should concisely generate high-level PL with similar functionality to the source low-level PL and semantic information (e.g., meaningful variable names), just like human-written code. Unfortunately, existing manually-defined rule-based decompilation techniques only functionally restore the low-level PL to a similar high-level PL and are still powerless to recover semantic information. In this paper, we propose a novel neural decompilation approach to translate low-level PL into accurate and user-friendly high-level PL, effectively improving its readability and understandability. Furthermore, we implement the proposed approaches called SEAM. Evaluations on four real-world applications show that SEAM has an average accuracy of 94.41%, which is much better than prior neural machine translation (NMT) models. Finally, we evaluate the effectiveness of semantic information recovery through a questionnaire survey, and the average accuracy is 92.64%, which is comparable or superior to the state-of-the-art compilers. ",
    "ENTRYTYPE": "article",
    "ID": "Liang2021"
  },
  {
    "year": "2022",
    "title": "Decompiling x86 Deep Neural Network Executables",
    "note": "The extended version of a paper to appear in the Proceedings of the 32nd USENIX Security Symposium, 2023, (USENIX Security '23), 25 pages",
    "month": "oct",
    "howpublished": "\\url{https://arxiv.org/pdf/2210.01075}",
    "doi": "https://doi.org/10.48550/arXiv.2210.01075",
    "author": "Liu, Zhibo AND Yuan, Yuanyuan AND Wang, Shuai AND Xie, Xiaofei AND Ma, Lei",
    "abstract": "Due to their widespread use on heterogeneous hardware devices, deep learning (DL) models are compiled into executables by DL compilers to fully leverage low-level hardware primitives. This approach allows DL computations to be undertaken at low cost across a variety of computing platforms, including CPUs, GPUs, and various hardware accelerators. We present BTD (Bin to DNN), a decompiler for deep neural network (DNN) executables. BTD takes DNN executables and outputs full model specifications, including types of DNN operators, network topology, dimensions, and parameters that are (nearly) identical to those of the input models. BTD delivers a practical framework to process DNN executables compiled by different DL compilers and with full optimizations enabled on x86 platforms. It employs learning-based techniques to infer DNN operators, dynamic analysis to reveal network architectures, and symbolic execution to facilitate inferring dimensions and parameters of DNN operators. Our evaluation reveals that BTD enables accurate recovery of full specifications of complex DNNs with millions of parameters (e.g., ResNet). The recovered DNN specifications can be re-compiled into a new DNN executable exhibiting identical behavior to the input executable. We show that BTD can boost two representative attacks, adversarial example generation and knowledge stealing, against DNN executables. We also demonstrate cross-architecture legacy code reuse using BTD, and envision BTD being used for other critical downstream tasks like DNN security hardening and patching. ",
    "ENTRYTYPE": "article",
    "ID": "Liu2022"
  },
  {
    "year": "2025",
    "title": "The CodeInverter Suite: Control-Flow and Data-Mapping Augmented Binary Decompilation with LLMs",
    "note": "",
    "month": "may",
    "howpublished": "\\url{https://arxiv.org/pdf/2503.07215}",
    "doi": "https://doi.org/10.48550/arXiv.2503.07215",
    "author": "Liu, Peipei AND Sun, Jian AND Sun, Rongkang AND Chen, Li AND Yan, Zhaoteng AND Zhang, Peizheng AND Sun, Dapeng AND Wang, Dawei AND Zhang, Xiaoling AND Li, Dan",
    "abstract": "Binary decompilation plays a vital role in various cybersecurity and software engineering tasks. Recently, end-to-end decompilation methods powered by large language models (LLMs) have garnered significant attention due to their ability to generate highly readable source code with minimal human intervention. However, existing LLM-based approaches face several critical challenges, including limited capability in reconstructing code structure and logic, low accuracy in data recovery, concerns over data security and privacy, and high computational resource requirements. To address these issues, we develop the CodeInverter Suite, making three contributions: (1) the CodeInverter Workflow (CIW) is a novel prompt engineering workflow that incorporates control flow graphs (CFG) and explicit data mappings to improve LLM-based decompilation. (2) Using CIW on well-known source code datasets, we curate the CodeInverter Dataset (CID), a domain-specific dataset containing 8.69 million samples that contains CFGs and data mapping tables. (3) We train the CoderInverter Models (CIMs) on CID, generating two lightweight LLMs (with 1.3B and 6.7B parameters) intended for efficient inference in privacy-sensitive or resource-constrained environments. Extensive experiments on two benchmarks demonstrate that the CIW substantially enhances the performance of various LLMs across multiple metrics. Our CIM-6.7B can achieve state-of-the-art decompilation performance, outperforming existing LLMs even with over 100x more parameters in decompilation tasks, an average improvement of 11.03% in re-executability, 6.27% in edit similarity. ",
    "ENTRYTYPE": "article",
    "ID": "Liu2025"
  },
  {
    "year": "2026",
    "title": "From Transactions to Exploits: Automated PoC Synthesis for Real-World DeFi Attacks",
    "note": "14 pages, 10 figures",
    "month": "jan",
    "howpublished": "\\url{https://arxiv.org/pdf/2601.16681}",
    "doi": "https://doi.org/10.48550/arXiv.2601.16681",
    "author": "Su, Xing AND Wu, Hao AND Liang, Hanzhong AND Jiang, Yunlin AND Cheng, Yuxi AND Liu, Yating AND Xu, Fengyuan",
    "abstract": "Blockchain systems are increasingly targeted by on-chain attacks that exploit contract vulnerabilities to extract value rapidly and stealthily, making systematic analysis and reproduction highly challenging. In practice, reproducing such attacks requires manually crafting proofs-of-concept (PoCs), a labor-intensive process that demands substantial expertise and scales poorly. In this work, we present the first automated framework for synthesizing verifiable PoCs directly from on-chain attack executions. Our key insight is that attacker logic can be recovered from low-level transaction traces via trace-driven reverse engineering, and then translated into executable exploits by leveraging the code-generation capabilities of large language models (LLMs). To this end, we propose TracExp, which localizes attack-relevant execution contexts from noisy, multi-contract traces and introduces a novel dual-decompiler to transform concrete executions into semantically enriched exploit pseudocode. Guided by this representation, TracExp synthesizes PoCs and refines them to preserve exploitability-relevant semantics. We evaluate TracExp on 321 real-world attacks over the past 20 months. TracExp successfully synthesizes PoCs for 93% of incidents, with 58.78% being directly verifiable, at an average cost of only \\$0.07 per case. Moreover, TracExp enabled the release of a large number of previously unavailable PoCs to the community, earning a $900 bounty and demonstrating strong practical impact. ",
    "ENTRYTYPE": "article",
    "ID": "Su2026"
  },
  {
    "year": "2023",
    "title": "Code Translation with Compiler Representations",
    "note": "9 pages",
    "month": "apr",
    "howpublished": "\\url{https://arxiv.org/pdf/2207.03578}",
    "doi": "https://doi.org/10.48550/arXiv.2207.03578",
    "author": "Szafraniec, Marc AND Roziere, Baptiste AND Leather, Hugh AND Charton, Francois AND Labatut, Patrick AND Synnaeve, Gabriel",
    "abstract": "In this paper, we leverage low-level compiler intermediate representations (IR) to improve code translation. Traditional transpilers rely on syntactic information and handcrafted rules, which limits their applicability and produces unnatural-looking code. Applying neural machine translation (NMT) approaches to code has successfully broadened the set of programs on which one can get a natural-looking translation. However, they treat the code as sequences of text tokens, and still do not differentiate well enough between similar pieces of code which have different semantics in different languages. The consequence is low quality translation, reducing the practicality of NMT, and stressing the need for an approach significantly increasing its accuracy. Here we propose to augment code translation with IRs, specifically LLVM IR, with results on the C++, Java, Rust, and Go languages. Our method improves upon the state of the art for unsupervised code translation, increasing the number of correct translations by 11% on average, and up to 79% for the Java -> Rust pair with greedy decoding. We extend previous test sets for code translation, by adding hundreds of Go and Rust functions. Additionally, we train models with high performance on the problem of IR decompilation, generating programming source code from IR, and study using IRs as intermediary pivot for translation. ",
    "ENTRYTYPE": "article",
    "ID": "Szafraniec2023"
  },
  {
    "year": "2024",
    "title": "LLM4Decompile: Decompiling Binary Code with Large Language Models",
    "note": "",
    "month": "oct",
    "howpublished": "\\url{https://arxiv.org/pdf/2403.05286}",
    "doi": "https://doi.org/10.48550/arXiv.2403.05286",
    "author": "Tan, Hanzhuo AND Luo, Qi AND Li, Jing AND Zhang, Yuqun",
    "abstract": "Decompilation aims to convert binary code to high-level source code, but traditional tools like Ghidra often produce results that are difficult to read and execute. Motivated by the advancements in Large Language Models (LLMs), we propose LLM4Decompile, the first and largest open-source LLM series (1.3B to 33B) trained to decompile binary code. We optimize the LLM training process and introduce the LLM4Decompile-End models to decompile binary directly. The resulting models significantly outperform GPT-4o and Ghidra on the HumanEval and ExeBench benchmarks by over 100% in terms of re-executability rate. Additionally, we improve the standard refinement approach to fine-tune the LLM4Decompile-Ref models, enabling them to effectively refine the decompiled code from Ghidra and achieve a further 16.2% improvement over the LLM4Decompile-End. LLM4Decompile demonstrates the potential of LLMs to revolutionize binary code decompilation, delivering remarkable improvements in readability and executability while complementing conventional tools for optimal results. Our code, dataset, and models are released at https://github.com/albertan017/LLM4Decompile ",
    "ENTRYTYPE": "article",
    "ID": "Tan2024"
  },
  {
    "year": "2025",
    "title": "Decompile-Bench: Million-Scale Binary-Source Function Pairs for Real-World Binary Decompilation",
    "note": "",
    "month": "oct",
    "howpublished": "\\url{https://arxiv.org/pdf/2505.12668}",
    "doi": "https://doi.org/10.48550/arXiv.2505.12668",
    "author": "Tan, Hanzhuo AND Tian, Xiaolong AND Qi, Hanrui AND Liu, Jiaming AND Gao, Zuchen AND Wang, Siyi AND Luo, Qi AND Li, Jing AND Zhang, Yuqun",
    "abstract": "Recent advances in LLM-based decompilers have been shown effective to convert low-level binaries into human-readable source code. However, there still lacks a comprehensive benchmark that provides large-scale binary-source function pairs, which is critical for advancing the LLM decompilation technology. Creating accurate binary-source mappings incurs severe issues caused by complex compilation settings and widespread function inlining that obscure the correspondence between binaries and their original source code. Previous efforts have either relied on used contest-style benchmarks, synthetic binary-source mappings that diverge significantly from the mappings in real world, or partially matched binaries with only code lines or variable names, compromising the effectiveness of analyzing the binary functionality. To alleviate these issues, we introduce Decompile-Bench, the first open-source dataset comprising two million binary-source function pairs condensed from 100 million collected function pairs, i.e., 450GB of binaries compiled from permissively licensed GitHub projects. For the evaluation purposes, we also developed a benchmark Decompile-Bench-Eval including manually crafted binaries from the well-established HumanEval and MBPP, alongside the compiled GitHub repositories released after 2025 to mitigate data leakage issues. We further explore commonly-used evaluation metrics to provide a thorough assessment of the studied LLM decompilers and find that fine-tuning with Decompile-Bench causes a 20% improvement over previous benchmarks in terms of the re-executability rate. Our code and data has been released in HuggingFace and Github. https://github.com/albertan017/LLM4Decompile ",
    "ENTRYTYPE": "article",
    "ID": "Tan2025"
  },
  {
    "year": "2024",
    "title": "Neural Decompiling of Tracr Transformers",
    "note": "",
    "month": "sep",
    "howpublished": "\\url{https://arxiv.org/pdf/2410.00061}",
    "doi": "https://doi.org/10.48550/arXiv.2410.00061",
    "author": "Thurnherr, Hannes AND Riesen, Kaspar",
    "abstract": "Recently, the transformer architecture has enabled substantial progress in many areas of pattern recognition and machine learning. However, as with other neural network models, there is currently no general method available to explain their inner workings. The present paper represents a first step towards this direction. We utilize \\textit\\{Transformer Compiler for RASP\\} (Tracr) to generate a large dataset of pairs of transformer weights and corresponding RASP programs. Based on this dataset, we then build and train a model, with the aim of recovering the RASP code from the compiled model. We demonstrate that the simple form of Tracr compiled transformer weights is interpretable for such a decompiler model. In an empirical evaluation, our model achieves exact reproductions on more than 30\\% of the test objects, while the remaining 70\\% can generally be reproduced with only few errors. Additionally, more than 70\\% of the programs, produced by our model, are functionally equivalent to the ground truth, and therefore a valid decompilation of the Tracr compiled transformer weights. ",
    "ENTRYTYPE": "article",
    "ID": "Thurnherr2024"
  },
  {
    "year": "2023",
    "title": "Refining Decompiled C Code with Large Language Models",
    "note": "",
    "month": "nov",
    "howpublished": "\\url{https://arxiv.org/pdf/2310.06530}",
    "doi": "https://doi.org/10.48550/arXiv.2310.06530",
    "author": "Wong, Kin, Wai AND Wang, Huaijin AND Li, Zongjie AND Liu, Zhibo AND Wang, Shuai AND Tang, Qiyi AND Nie, Sen AND Wu, Shi",
    "abstract": "A C decompiler converts an executable into source code. The recovered C source code, once re-compiled, is expected to produce an executable with the same functionality as the original executable. With over twenty years of development, C decompilers have been widely used in production to support reverse engineering applications. Despite the prosperous development of C decompilers, it is widely acknowledged that decompiler outputs are mainly used for human consumption, and are not suitable for automatic recompilation. Often, a substantial amount of manual effort is required to fix the decompiler outputs before they can be recompiled and executed properly. This paper is motived by the recent success of large language models (LLMs) in comprehending dense corpus of natural language. To alleviate the tedious, costly and often error-prone manual effort in fixing decompiler outputs, we investigate the feasibility of using LLMs to augment decompiler outputs, thus delivering recompilable decompilation. Note that different from previous efforts that focus on augmenting decompiler outputs with higher readability (e.g., recovering type/variable names), we focus on augmenting decompiler outputs with recompilability, meaning to generate code that can be recompiled into an executable with the same functionality as the original executable. We conduct a pilot study to characterize the obstacles in recompiling the outputs of the de facto commercial C decompiler -- IDA-Pro. We then propose a two-step, hybrid approach to augmenting decompiler outputs with LLMs. We evaluate our approach on a set of popular C test cases, and show that our approach can deliver a high recompilation success rate to over 75% with moderate effort, whereas none of the IDA-Pro's original outputs can be recompiled. We conclude with a discussion on the limitations of our approach and promising future research directions. ",
    "ENTRYTYPE": "article",
    "ID": "Wong2023"
  },
  {
    "year": "2017",
    "web-of-science-index": "Science Citation Index Expanded (SCI-EXPANDED)",
    "web-of-science-categories": "Engineering, Electrical \\& Electronic",
    "volume": "26",
    "usage-count-since-2013": "11",
    "usage-count-last-180-days": "0",
    "unique-id": "WOS:000415662500002",
    "type": "Article",
    "title": "Control Structure Analysis and Recovery of Embedded Binaries",
    "times-cited": "0",
    "researcherid-numbers": "wang, yizhuo/LXW-7659-2024",
    "research-areas": "Engineering",
    "publisher": "TECHNOLOGY EXCHANGE LIMITED HONG KONG",
    "pages": "1118-1124",
    "oa": "Bronze",
    "number-of-cited-references": "26",
    "number": "6",
    "month": "NOV",
    "language": "English",
    "keywords-plus": "PROGRAMS",
    "keywords": "Decompiling; Control flow graph restructuring; Structural analysis;\nGenetic algorithm (GA)",
    "journal-iso": "Chin. J. Electron.",
    "journal": "CHINESE JOURNAL OF ELECTRONICS",
    "issn": "1022-4653",
    "funding-text": "This work is supported by the National Natural Science Foundation of\nChina (No.61300010).",
    "funding-acknowledgement": "National Natural Science Foundation of China {[}61300010]",
    "eissn": "2075-5597",
    "doi": "10.1049/cje.2017.09.003",
    "doc-delivery-number": "FN0IW",
    "da": "2026-02-04",
    "cited-references": "AMMARGUELLAT Z, 1992, IEEE T SOFTWARE ENG, V18, P237, DOI 10.1109/32.126773.\nARM Ltd. and ARM Germany GmbH, 2015, KEIL C51 C COMP.\nAshcroft E., 1979, CLASSICS SOFTWARE EN.\nBAKER AL, 1980, IEEE T SOFTWARE ENG, V6, P506, DOI 10.1109/TSE.1980.230799.\nBAKER BS, 1977, J ACM, V24, P98, DOI 10.1145/321992.321999.\nBao T, 2014, PROCEEDINGS OF THE 23RD USENIX SECURITY SYMPOSIUM, P845.\n{[}陈芳园 Chen Fangyuan], 2012, {[}电子学报, Acta Electronica Sinica], V40, P1372.\nChen GBA, 2013, SOFTWARE PRACT EXPER, V43, P1337, DOI 10.1002/spe.2138.\nChen Ping, 2010, Acta Electronica Sinica, V38, P1741.\nCifuentes C., 1992, P 19 C LAT INF, P257.\nCifuentes Cristina, 1993, P 19 C LAT INF AT, P267.\nEROSA AM, 1994, PROCEEDINGS OF THE 1994 INTERNATIONAL CONFERENCE ON COMPUTER LANGUAGES, P229, DOI 10.1109/ICCL.1994.288377.\nFlatassembler, 2015, FLAT ASS.\nGuthaus MR, 2001, WWC-4: IEEE INTERNATIONAL WORKSHOP ON WORKLOAD CHARACTERIZATION, P3, DOI 10.1109/WWC.2001.990739.\nHolland J., 1975, Adaptive in Natural and artificial Systems.\nKnuth D. E., 1971, Information Processing Letters, V1, P23, DOI 10.1016/0020-0190(71)90018-4.\nLICHTBLAU U, 1985, PROC INT JOINT C, V185, P284.\nMuchnick S.S., 1997, Advanced Compiler Design and Implementation.\nNaeem NA, 2006, INT C PROGRAM COMPRE, P327, DOI 10.1109/ICPC.2006.40.\nOULSNAM G, 1982, COMPUT J, V25, P379, DOI 10.1093/comjnl/25.3.379.\nPfeffer T.F., 2014, P 7 INT C SEC INF NE, P345.\nRAMSHAW L, 1988, J ACM, V35, P893, DOI 10.1145/48014.48021.\n{[}任武 Ren Wu], 2013, {[}电子学报, Acta Electronica Sinica], V41, P1412.\nTroshina K., 2009, P INT WORKSHOP PROGR, P18.\nWilliams M.H., 1997, COMPUT J, V20, P45.\nWILLIAMS MH, 1985, COMPUT J, V28, P134, DOI 10.1093/comjnl/28.2.134.",
    "author-email": "jwx@bit.edu.cn\nhyh@bit.edu.cn\nfrankwyz@bit.edu.cn\npaulgyj@bit.edu.cn\nbitsf@bit.edu.cn",
    "author": "Ji Weixing and Huo Yuanhong and Wang Yizhuo and Gao Yujin and Shi Feng",
    "affiliations": "Beijing Institute of Technology",
    "affiliation": "Ji, WX (Corresponding Author), Beijing Inst Technol, Beijing 100081, Peoples R China.\nJi Weixing; Huo Yuanhong; Wang Yizhuo; Gao Yujin; Shi Feng, Beijing Inst Technol, Beijing 100081, Peoples R China.",
    "address": "26-28 AU PUI WAN ST, STE 1102, FO TAN INDUSTRIAL CENTRE, FO TAN, SHATIN,\n00000, PEOPLES R CHINA",
    "abstract": "Existing decompilers use rule-based algorithms to transform unstructured\nControl flow graph (CFG) into equivalent high-level programming language\nconstructs with ``goto{''} statements. One problem of such approaches is\nthat they generate a large number of ``goto{''}s in the output code,\nwhich reduce the readability and hinder the understanding of input\nbinaries. A global search algorithm is proposed based on structural\nanalysis. This algorithm restructures a CFG and generates fewer number\nof ``goto{''} statements than the rule-based algorithm does. We also\npresent a Genetic algorithm (GA) for the global search approach to\nlocate near optimal solutions for large CFGs. Evaluation results on a\nset of real CFGs show that the genetic algorithm-based heuristic for\nglobal search is capable of finding high-quality solutions.",
    "ENTRYTYPE": "article",
    "ID": "WOS:000415662500002"
  },
  {
    "year": "2021",
    "web-of-science-index": "Emerging Sources Citation Index (ESCI)",
    "web-of-science-categories": "Computer Science, Information Systems; Computer Science,\nInterdisciplinary Applications; Computer Science, Software Engineering",
    "volume": "4",
    "usage-count-since-2013": "7",
    "usage-count-last-180-days": "0",
    "unique-id": "WOS:000672841700001",
    "type": "Article",
    "title": "Neutron: an attention-based neural decompiler",
    "times-cited": "12",
    "researcherid-numbers": "Liang, Ruigang/HQZ-6397-2023",
    "research-areas": "Computer Science",
    "publisher": "SPRINGERNATURE",
    "oa": "Green Submitted, gold",
    "number-of-cited-references": "34",
    "number": "1",
    "month": "MAR 5",
    "language": "English",
    "keywords": "Decompilation; LSTM; Attention; Translation",
    "journal-iso": "Cybersecurity",
    "journal": "CYBERSECURITY",
    "issn": "2523-3246",
    "funding-text": "Our research was supported by NSFC U1836211. And the recipient is\nProfessor Kai Chen.",
    "funding-acknowledgement": "NSFC {[}U1836211]",
    "doi": "10.1186/s42400-021-00070-0",
    "doc-delivery-number": "TI5KP",
    "da": "2026-02-04",
    "cited-references": "Allamanis M, 2015, PR MACH LEARN RES, V37, P2123.\n{[}Anonymous], 2020, MATH C LIB.\nDurfina L, 2013, WORK CONF REVERSE EN, P449, DOI 10.1109/WCRE.2013.6671321.\nFu C, 2019, ADV NEUR IN, V32.\nHeo K, 2017, PROC INT CONF SOFTW, P519, DOI 10.1109/ICSE.2017.54.\nHochreiter S, 1997, NEURAL COMPUT, V9, P1735, DOI {[}10.1162/neco.1997.9.8.1735, 10.1007/978-3-642-24797-2, 10.1162/neco.1997.9.1.1].\nKatz DS, 2018, 2018 25TH IEEE INTERNATIONAL CONFERENCE ON SOFTWARE ANALYSIS, EVOLUTION AND REENGINEERING (SANER 2018), P346, DOI 10.1109/SANER.2018.8330222.\nKatz Omer, 2019, CoRR.\nKoustek J., 2017, Retdec: An open-source machine-code decompiler.\nLevy D, 2017, PR MACH LEARN RES, V70.\nLiu ZB, 2020, PROCEEDINGS OF THE 29TH ACM SIGSOFT INTERNATIONAL SYMPOSIUM ON SOFTWARE TESTING AND ANALYSIS, ISSTA 2020, P475, DOI 10.1145/3395363.3397370.\nLoyola P, 2017, PROCEEDINGS OF THE 55TH ANNUAL MEETING OF THE ASSOCIATION FOR COMPUTATIONAL LINGUISTICS (ACL 2017), VOL 2, P287, DOI 10.18653/v1/P17-2045.\nLuong T., 2015, P 2015 C EMPIRICAL M, P1412, DOI DOI 10.18653/V1/D15-1166.\nMedress M. F., 1977, Artificial Intelligence, V9, P307, DOI 10.1016/0004-3702(77)90026-1.\nPEARLMUTTER BA, 1995, IEEE T NEURAL NETWOR, V6, P1212, DOI 10.1109/72.410363.\nPeng C., 2018, 25 ANN NETWORK DISTR, DOI DOI 10.14722/NDSS.2018.23158.\nPeng F, 2014, PROCEEDINGS OF THE 23RD USENIX SECURITY SYMPOSIUM, P829.\nSchkufza E, 2013, ACM SIGPLAN NOTICES, V48, P305, DOI 10.1145/2499368.2451150.\nSchwartz Edward J., 2013, Proceedings of the 22nd USENIX Security Symposium. Security `13, P353.\nShi T, 2018, ACM T DATA SCI, V2.\nShoshitaishvili Y, 2016, P IEEE S SECUR PRIV, P138, DOI 10.1109/SP.2016.17.\nSutskever I, 2014, ADV NEUR IN, V27.\ntensor, 2020, TENSOR 2TENSOR.\nurfina L, 2011, P 2 INT C CIRC SYST, P199.\nWang Y, 2018, PROCEEDINGS OF THE 2018 ACM SIGSAC CONFERENCE ON COMPUTER AND COMMUNICATIONS SECURITY (CCS'18), P1914, DOI 10.1145/3243734.3243847.\nWarren H.S., 2012, HACKERS DELIGHT, V2nd.\nWu Y, 2016, ARXIV160908144, DOI {[}10.1145/3234150, DOI 10.1145/3234150].\nYadegari B, 2015, P IEEE S SECUR PRIV, P674, DOI 10.1109/SP.2015.47.\nYakdan K, 2015, MORE GOTOS DECOMPILA.\nYakdan K, 2016, P IEEE S SECUR PRIV, P158, DOI 10.1109/SP.2016.18.\nYang XJ, 2011, PLDI 11: PROCEEDINGS OF THE 2011 ACM CONFERENCE ON PROGRAMMING LANGUAGE DESIGN AND IMPLEMENTATION, P283.\nYang ZC, 2016, PROC CVPR IEEE, P21, DOI 10.1109/CVPR.2016.10.\nYou W, 2017, CCS'17: PROCEEDINGS OF THE 2017 ACM SIGSAC CONFERENCE ON COMPUTER AND COMMUNICATIONS SECURITY, P2139, DOI 10.1145/3133956.3134085.\nZong PY, 2020, PROCEEDINGS OF THE 29TH USENIX SECURITY SYMPOSIUM, P2255.",
    "author-email": "liangruigang@iie.ac.cn\nchenkai@iie.ac.cn",
    "author": "Liang, Ruigang and Cao, Ying and Hu, Peiwei and Chen, Kai",
    "article-number": "5",
    "affiliations": "Chinese Academy of Sciences; Institute of Information Engineering, CAS;\nChinese Academy of Sciences; University of Chinese Academy of Sciences,\nCAS",
    "affiliation": "Liang, RG; Chen, K (Corresponding Author), Chinese Acad Sci, Inst Informat Engn, SKLOIS, Beijing 100093, Peoples R China.\nLiang, RG; Chen, K (Corresponding Author), Univ Chinese Acad Sci, Sch Cyber Secur, Beijing 100049, Peoples R China.\nLiang, Ruigang; Cao, Ying; Hu, Peiwei; Chen, Kai, Chinese Acad Sci, Inst Informat Engn, SKLOIS, Beijing 100093, Peoples R China.\nLiang, Ruigang; Cao, Ying; Hu, Peiwei; Chen, Kai, Univ Chinese Acad Sci, Sch Cyber Secur, Beijing 100049, Peoples R China.",
    "address": "CAMPUS, 4 CRINAN ST, LONDON, N1 9XW, ENGLAND",
    "abstract": "Decompilation aims to analyze and transform low-level program language\n(PL) codes such as binary code or assembly code to obtain an equivalent\nhigh-level PL. Decompilation plays a vital role in the cyberspace\nsecurity fields such as software vulnerability discovery and analysis,\nmalicious code detection and analysis, and software engineering fields\nsuch as source code analysis, optimization, and cross-language\ncross-operating system migration. Unfortunately, the existing\ndecompilers mainly rely on experts to write rules, which leads to\nbottlenecks such as low scalability, development difficulties, and long\ncycles. The generated high-level PL codes often violate the code writing\nspecifications. Further, their readability is still relatively low. The\nproblems mentioned above hinder the efficiency of advanced applications\n(e.g., vulnerability discovery) based on decompiled high-level PL\ncodes.In this paper, we propose a decompilation approach based on the\nattention-based neural machine translation (NMT) mechanism, which\nconverts low-level PL into high-level PL while acquiring legibility and\nkeeping functionally similar. To compensate for the information\nasymmetry between the low-level and high-level PL, a translation method\nbased on basic operations of low-level PL is designed. This method\nimproves the generalization of the NMT model and captures the\ntranslation rules between PLs more accurately and efficiently. Besides,\nwe implement a neural decompilation framework called Neutron. The\nevaluation of two practical applications shows that Neutron's average\nprogram accuracy is 96.96\\%, which is better than the traditional NMT\nmodel.",
    "ENTRYTYPE": "article",
    "ID": "WOS:000672841700001"
  },
  {
    "year": "2022",
    "web-of-science-index": "Science Citation Index Expanded (SCI-EXPANDED)",
    "web-of-science-categories": "Computer Science, Software Engineering; Engineering, Electrical \\&\nElectronic",
    "volume": "48",
    "usage-count-since-2013": "4",
    "usage-count-last-180-days": "0",
    "unique-id": "WOS:000870301800008",
    "type": "Article",
    "title": "Learning to Find Usages of Library Functions in Optimized Binaries",
    "times-cited": "6",
    "research-areas": "Computer Science; Engineering",
    "publisher": "IEEE COMPUTER SOC",
    "pages": "3862-3876",
    "orcid-numbers": "Sawant, Anand/0000-0002-5816-8020\nAhmed, Toufique/0000-0002-4427-1350",
    "oa": "Green Submitted",
    "number-of-cited-references": "46",
    "number": "10",
    "month": "OCT 1",
    "language": "English",
    "keywords": "Libraries; Tools; Optimization; Databases; Reverse engineering;\nTraining; Malware; Reverse engineering; software modeling; deep learning",
    "journal-iso": "IEEE Trans. Softw. Eng.",
    "journal": "IEEE TRANSACTIONS ON SOFTWARE ENGINEERING",
    "issn": "0098-5589",
    "funding-text": "This work was supported in part by NSF CISE (SHF LARGE) under Grant\n1414172, and in part by Sandia National Laboratories. The work of\nToufique Ahmed was supported by a Dean's Distinguished Graduate\nFellowship, UC Davis. This article was much improved as a result of\nreviewers' comments, forwhich the authors are thankful.",
    "funding-acknowledgement": "NSF CISE (SHF LARGE) {[}1414172]; Sandia National Laboratories; Dean's\nDistinguished Graduate Fellowship, UC Davis",
    "eissn": "1939-3520",
    "doi": "10.1109/TSE.2021.3106572",
    "doc-delivery-number": "5L3GA",
    "da": "2026-02-04",
    "cited-references": "{[}Anonymous], 2008, UTDCS0508.\n{[}Anonymous], 2020, TRAVIS BUILD UTILITY.\n{[}Anonymous], 2020, DOCKER CONTAINERS CR.\n{[}Anonymous], 2020, HUGGINGFACE TRANSFOR.\n{[}Anonymous], 2020, BUGSWARMGITHUBORY RE.\n{[}Anonymous], 2020, TRAVIS DOCKERHUB REP.\nBao T, 2014, PROCEEDINGS OF THE 23RD USENIX SECURITY SYMPOSIUM, P845.\nBayer U., 2006, THESIS TU VIENNA VIE.\nBE H. B., 2020, HEXRAYS IDA PRO.\nBE H. B., 2020, HEXRAYS IDA PROINLIN.\nBE H. B., FLIRT SIGNATURES.\nBlinded, 2020, REPLICATION PACKAGE, DOI {[}10.5281/zenodo.4007527, DOI 10.5281/ZENODO.4007527].\nCasalnuovo C, 2019, EMPIR SOFTW ENG, V24, P1823, DOI 10.1007/s10664-018-9669-7.\nCHIKOFSKY EJ, 1990, IEEE SOFTWARE, V7, P13, DOI 10.1109/52.43044.\nCollard ML, 2011, IEEE INT WORK C SO, P173, DOI 10.1109/SCAM.2011.19.\nDavid Y, 2020, P ACM PROGRAM LANG, V4, DOI 10.1145/3428293.\nDevlin J, 2019, Arxiv, DOI {[}arXiv:1810.04805, DOI 10.48550/ARXIV.1810.04805, 10.48550/arXiv.1810.04805].\nDocker, 2020, DOCK JOB MATR CONF.\nEisenbarth T, 2001, PROC IEEE INT CONF S, P602, DOI 10.1109/ICSM.2001.972777.\nFeng ZY, 2020, Arxiv, DOI arXiv:2002.08155.\nHe JX, 2018, PROCEEDINGS OF THE 2018 ACM SIGSAC CONFERENCE ON COMPUTER AND COMMUNICATIONS SECURITY (CCS'18), P1667, DOI 10.1145/3243734.3243866.\nHunt G, 1999, PROCEEDINGS OF THE 3RD USENIX WINDOWS NT SYMPOSIUM, P135.\nIslam R, 2013, J NETW COMPUT APPL, V36, P646, DOI 10.1016/j.jnca.2012.10.004.\nKanade A, 2020, PR MACH LEARN RES, V119.\nKatz O, 2019, Arxiv, DOI arXiv:1905.08325.\nLacomis J, 2019, 34TH IEEE/ACM INTERNATIONAL CONFERENCE ON AUTOMATED SOFTWARE ENGINEERING (ASE 2019), P640, DOI 10.1109/ASE.2019.00064.\nLiu YH, 2019, Arxiv, DOI {[}arXiv:1907.11692, 10.48550/arXiv.1907.11692, DOI 10.48550/ARXIV.1907.11692(APP.SCINITO.AI)].\nNSA, 2020, GHIDRA.\nPei KX, 2020, Arxiv, DOI arXiv:2010.00770.\nQiu J, 2015, 2015 22ND INTERNATIONAL CONFERENCE ON SOFTWARE ANALYSIS, EVOLUTION, AND REENGINEERING (SANER), P261, DOI 10.1109/SANER.2015.7081836.\nQiu J, 2016, IEEE T SOFTWARE ENG, V42, P187, DOI 10.1109/TSE.2015.2470241.\nRonghua Tian, 2010, 2010 5th International Conference on Malicious and Unwanted Software (MALWARE 2010), P23, DOI 10.1109/MALWARE.2010.5665796.\nSchultz MG, 2001, P IEEE S SECUR PRIV, P38, DOI 10.1109/SECPRI.2001.924286.\nShin ECR, 2015, PROCEEDINGS OF THE 24TH USENIX SECURITY SYMPOSIUM, P611.\nShirani P, 2017, LECT NOTES COMPUT SC, V10327, P301, DOI 10.1007/978-3-319-60876-1\\_14.\nSong D, 2008, LECT NOTES COMPUT SC, V5352, P1, DOI 10.1007/978-3-540-89862-7\\_1.\nTomassi DA, 2019, PROC INT CONF SOFTW, P339, DOI 10.1109/ICSE.2019.00048.\nVaswani A, 2017, ADV NEUR IN, V30.\nWang S, 2017, PROC IEEE INT CONF S, P388, DOI 10.1109/ICSME.2017.59.\nWang TY, 2006, IEEE C EVOL COMPUTAT, P3221.\nWillems C, 2007, IEEE SECUR PRIV, V5, P32, DOI 10.1109/MSP.2007.45.\nYe YF, 2017, ACM COMPUT SURV, V50, DOI 10.1145/3073559.\nYe YF, 2010, J INTELL INF SYST, V35, P1, DOI 10.1007/s10844-009-0086-7.\nYe YF, 2010, IEEE T SYST MAN CY C, V40, P298, DOI 10.1109/TSMCC.2009.2037978.\nYe YF, 2009, KDD-09: 15TH ACM SIGKDD CONFERENCE ON KNOWLEDGE DISCOVERY AND DATA MINING, P1385.\nYe YF, 2007, KDD-2007 PROCEEDINGS OF THE THIRTEENTH ACM SIGKDD INTERNATIONAL CONFERENCE ON KNOWLEDGE DISCOVERY AND DATA MINING, P1043.",
    "author-email": "tfahmed@ucdavis.edu\nptdevanbu@ucdavis.edu\nasawant@ucdavis.edu",
    "author": "Ahmed, Toufique and Devanbu, Premkumar and Sawant, Anand Ashok",
    "affiliations": "University of California System; University of California Davis",
    "affiliation": "Ahmed, T (Corresponding Author), Univ Calif Davis, Dept Comp Sci, Davis, CA 95616 USA.\nAhmed, Toufique; Devanbu, Premkumar; Sawant, Anand Ashok, Univ Calif Davis, Dept Comp Sci, Davis, CA 95616 USA.",
    "address": "10662 LOS VAQUEROS CIRCLE, PO BOX 3014, LOS ALAMITOS, CA 90720-1314 USA",
    "abstract": "Much software, whether beneficent or malevolent, is distributed only as\nbinaries, sans source code. Absent source code, understanding binaries'\nbehavior can be quite challenging, especially when compiled under higher\nlevels of compiler optimization. These optimizations can transform\ncomprehensible, ``natural{''} source constructions into something\nentirely unrecognizable. Reverse engineering binaries, especially those\nsuspected of being malevolent or guilty of intellectual property theft,\nare important and time-consuming tasks. There is a great deal of\ninterest in tools to ``decompile{''} binaries back into more natural\nsource code to aid reverse engineering. Decompilation involves several\ndesirable steps, including recreating source-language constructions,\nvariable names, and perhaps even comments. One central step in creating\nbinaries is optimizing function calls, using steps such as inlining.\nRecovering these (possibly inlined) function calls from optimized\nbinaries is an essential task that most state-of-the-art decompiler\ntools try to do but do not perform very well. In this paper, we evaluate\na supervised learning approach to the problem of recovering optimized\nfunction calls. We leverage open-source software and develop an\nautomated labeling scheme to generate a reasonably large dataset of\nbinaries labeled with actual function usages. We augment this large but\nlimited labeled dataset with a pre-training step, which learns the\ndecompiled code statistics from a much larger unlabeled dataset. Thus\naugmented, our learned labeling model can be combined with an existing\ndecompilation tool, Ghidra, to achieve substantially improved\nperformance in function call recovery, especially at higher levels of\noptimization.",
    "ENTRYTYPE": "article",
    "ID": "WOS:000870301800008"
  },
  {
    "year": "2023",
    "web-of-science-index": "Science Citation Index Expanded (SCI-EXPANDED)",
    "web-of-science-categories": "Computer Science, Software Engineering",
    "volume": "32",
    "usage-count-since-2013": "1",
    "usage-count-last-180-days": "0",
    "unique-id": "WOS:000970588900012",
    "type": "Article",
    "title": "DIRE and its Data: Neural Decompiled Variable Renamings with Respect to\nSoftware Class",
    "times-cited": "5",
    "research-areas": "Computer Science",
    "publisher": "ASSOC COMPUTING MACHINERY",
    "orcid-numbers": "Lacomis, Jeremy/0000-0003-0653-5738\nLe Goues, Claire/0000-0002-3931-060X\nVasilescu, Bogdan/0000-0003-4418-5783",
    "oa": "Bronze",
    "number-of-cited-references": "57",
    "number": "2",
    "month": "APR",
    "language": "English",
    "keywords": "Machine learning; decompilation; data provenance",
    "journal-iso": "ACM Trans. Softw. Eng. Methodol.",
    "journal": "ACM TRANSACTIONS ON SOFTWARE ENGINEERING AND METHODOLOGY",
    "issn": "1049-331X",
    "funding-text": "This material is based upon work supported in part by the Software\nEngineering Institute and National Science Foundation (NSF awards\nCCF-1815287 and CCF-1910067). We also gratefully acknowledge hardware\nsupport (Quadro P6000 GPU) from the NVIDIA Corporation.",
    "funding-acknowledgement": "Software Engineering Institute; National Science Foundation\n{[}CCF-1815287, CCF-1910067]; NVIDIA Corporation {[}P6000 GPU]",
    "eissn": "1557-7392",
    "doi": "10.1145/3546946",
    "doc-delivery-number": "D7OR1",
    "da": "2026-02-04",
    "cited-references": "Allamams M, 2019, PROCEEDINGS OF THE 2019 ACM SIGPLAN INTERNATIONAL SYMPOSIUM ON NEW IDEAS, NEW PARADIGMS, AND REFLECTIONS ON PROGRAMMING AND SOFTWARE (ONWARD!' 19), P143, DOI 10.1145/3359591.3359735.\nAllamanis M, 2018, ACM COMPUT SURV, V51, DOI 10.1145/3212695.\nAllamanis M, 2015, 2015 10TH JOINT MEETING OF THE EUROPEAN SOFTWARE ENGINEERING CONFERENCE AND THE ACM SIGSOFT SYMPOSIUM ON THE FOUNDATIONS OF SOFTWARE ENGINEERING (ESEC/FSE 2015) PROCEEDINGS, P38, DOI 10.1145/2786805.2786849.\nAllamanis M, 2014, 22ND ACM SIGSOFT INTERNATIONAL SYMPOSIUM ON THE FOUNDATIONS OF SOFTWARE ENGINEERING (FSE 2014), P281, DOI 10.1145/2635868.2635883.\nAllamanis Miltiadis., 2018, INT C LEARNING REPRE.\nAlon U., 2019, ICLR.\nArnaoudova V, 2014, IEEE T SOFTWARE ENG, V40, P502, DOI 10.1109/TSE.2014.2312942.\nBorges H, 2018, J SYST SOFTWARE, V146, P112, DOI 10.1016/j.jss.2018.09.016.\nChen QB, 2022, PROC INT CONF SOFTW, P2327, DOI 10.1145/3510003.3510162.\nChen Qibin, 2022, USENIX SECURITY S US.\nCho K, 2015, IEEE T MULTIMEDIA, V17, P1875, DOI 10.1109/TMM.2015.2477044.\nCho Kyunghyun., 2014, Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing EMNLP, P1724, DOI DOI 10.3115/V1/D14-1179.\nDevanbu P, 2015, 2015 IEEE/ACM 37TH IEEE INTERNATIONAL CONFERENCE ON SOFTWARE ENGINEERING, VOL 2, P543, DOI 10.1109/ICSE.2015.190.\nDurfina L, 2013, WORK CONF REVERSE EN, P449, DOI 10.1109/WCRE.2013.6671321.\nEager MichaelJ., 2012, Introduction to the DWARF Debugging Format{''}. In.\nGellenbeck E. M., 1991, Empirical Studies of Programmers: Fourth Workshop, P65.\nGhidra, 2019, GHIDR DEC.\nGilmer J, 2017, PR MACH LEARN RES, V70.\nGousios G, 2013, IEEE WORK CONF MIN S, P233, DOI 10.1109/MSR.2013.6624034.\nGowda T, 2020, FINDINGS OF THE ASSOCIATION FOR COMPUTATIONAL LINGUISTICS, EMNLP 2020, P3955.\nHe JX, 2018, PROCEEDINGS OF THE 2018 ACM SIGSAC CONFERENCE ON COMPUTER AND COMMUNICATIONS SECURITY (CCS'18), P1667, DOI 10.1145/3243734.3243866.\nHex-Rays, 2019, HEXRAYS DEC.\nHindle A, 2012, PROC INT CONF SOFTW, P837, DOI 10.1109/ICSE.2012.6227135.\nHochreiter S, 1997, NEURAL COMPUT, V9, P1735, DOI {[}10.1162/neco.1997.9.8.1735, 10.1007/978-3-642-24797-2, 10.1162/neco.1997.9.1.1].\nJaffe A, 2018, INT C PROGRAM COMPRE, P20, DOI 10.1145/3196321.3196330.\nJHU/APL Staff, 2019, ASS LAB LIB STAT AN.\nKang HJ, 2019, 34TH IEEE/ACM INTERNATIONAL CONFERENCE ON AUTOMATED SOFTWARE ENGINEERING (ASE 2019), P1, DOI 10.1109/ASE.2019.00011.\nKarampatsis RM, 2020, PROC INT CONF SOFTW, P1073, DOI 10.1145/3377811.3380342.\nKatz DS, 2018, 2018 25TH IEEE INTERNATIONAL CONFERENCE ON SOFTWARE ANALYSIS, EVOLUTION AND REENGINEERING (SANER 2018), P346, DOI 10.1109/SANER.2018.8330222.\nKoyuncu Anil, 2019, INT C SOFTWARE ENG I, P1.\nKudo T, 2018, CONFERENCE ON EMPIRICAL METHODS IN NATURAL LANGUAGE PROCESSING (EMNLP 2018): PROCEEDINGS OF SYSTEM DEMONSTRATIONS, P66.\nLacomis J, 2019, 34TH IEEE/ACM INTERNATIONAL CONFERENCE ON AUTOMATED SOFTWARE ENGINEERING (ASE 2019), P640, DOI 10.1109/ASE.2019.00064.\nLawrie D, 2006, INT C PROGRAM COMPRE, P3, DOI 10.1109/ICPC.2006.51.\nLee K, 2022, PROCEEDINGS OF THE 60TH ANNUAL MEETING OF THE ASSOCIATION FOR COMPUTATIONAL LINGUISTICS (ACL 2022), VOL 1: (LONG PAPERS), P8424.\nLi Y., 2016, INT C LEARNING REPRE.\nLiu H, 2015, IEEE T SOFTWARE ENG, V41, P887, DOI 10.1109/TSE.2015.2427831.\nLuong T., 2015, P 2015 C EMPIRICAL M, P1412, DOI DOI 10.18653/V1/D15-1166.\nMehrabi N, 2021, ACM COMPUT SURV, V54, DOI 10.1145/3457607.\nNitin Vikram, 2021, DIRECT TRANSFORMER B, P48.\nNussbaum Lucas, 2010, Proceedings of the 2010 7th IEEE Working Conference on Mining Software Repositories (MSR 2010), P52, DOI 10.1109/MSR.2010.5463277.\nPress W.H., 2002, NUMERICAL RECIPES C, V2nd.\nLe Q, 2014, PR MACH LEARN RES, V32, P1188.\nRabin MRI, 2021, INFORM SOFTWARE TECH, V135, DOI 10.1016/j.infsof.2021.106552.\nRaychev V, 2015, ACM SIGPLAN NOTICES, V50, P111, DOI {[}10.1145/2676726.2677009, 10.1145/2775051.2677009].\nRUMELHART DE, 1986, NATURE, V323, P533, DOI 10.1038/323533a0.\nSalesky E, 2020, MACH TRANSL, V34, P41, DOI 10.1007/s10590-019-09243-8.\nSalviulo F., 2014, Proceedings of the 18th International Conference on Evaluation and Assessment in Software Engineering, P48, DOI DOI 10.1145/2601248.2601251.\nScarselli F, 2009, IEEE T NEURAL NETWOR, V20, P61, DOI 10.1109/TNN.2008.2005605.\nSchwartz Edward J., 2013, Proceedings of the 22nd USENIX Security Symposium. Security `13, P353.\nSpinellis D, 2020, IEEE WORK CONF MIN S, P523, DOI 10.1145/3379597.3387496.\nTrockman A, 2018, PROCEEDINGS 2018 IEEE/ACM 40TH INTERNATIONAL CONFERENCE ON SOFTWARE ENGINEERING (ICSE), P511, DOI 10.1145/3180155.3180209.\nvan Emmerik Michael James, 2007, THESIS U QUEENSLAND.\nVasilescu B, 2017, ESEC/FSE 2017: PROCEEDINGS OF THE 2017 11TH JOINT MEETING ON FOUNDATIONS OF SOFTWARE ENGINEERING, P683, DOI 10.1145/3106237.3106289.\nVaswani A, 2017, ADV NEUR IN, V30.\nWang W., 2016, P 1 C MACH TRANSL, P505.\nYakdan K, 2015, 22ND ANNUAL NETWORK AND DISTRIBUTED SYSTEM SECURITY SYMPOSIUM (NDSS 2015), DOI 10.14722/ndss.2015.23185.\nYakdan K, 2016, P IEEE S SECUR PRIV, P158, DOI 10.1109/SP.2016.18.",
    "author-email": "lukedram@andrew.cmu.edu\njlacomis@cs.cmu.edu\npcyin@cs.cmu.edu\neschwartz@cert.org\nmiallama@microsoft.com\ngneubig@cs.cmu.edu\nvasilescu@cmu.edu\nclegoues@cs.cmu.edu",
    "author": "Dramko, Luke and Lacomis, Jeremy and Yin, Pengcheng and Schwartz, Ed and\nAllamanis, Miltiadis and Neubig, Graham and Vasilescu, Bogdan and Le\nGoues, Claire",
    "article-number": "39",
    "affiliations": "Carnegie Mellon University; Carnegie Mellon University; Microsoft;\nMicrosoft United Kingdom",
    "affiliation": "Dramko, L (Corresponding Author), Carnegie Mellon Univ, 5000 Forbes Ave, Pittsburgh, PA 15213 USA.\nDramko, Luke; Lacomis, Jeremy; Yin, Pengcheng; Neubig, Graham; Vasilescu, Bogdan; Le Goues, Claire, Carnegie Mellon Univ, 5000 Forbes Ave, Pittsburgh, PA 15213 USA.\nSchwartz, Ed, Carnegie Mellon Univ, Software Engn Inst, Pittsburgh, PA 15213 USA.\nAllamanis, Miltiadis, Microsoft Res, Cambridge, England.",
    "address": "1601 Broadway, 10th Floor, NEW YORK, NY USA",
    "abstract": "The decompiler is one of the most common tools for examining executable\nbinaries without the corresponding source code. It transforms binaries\ninto high-level code, reversing the compilation process. Unfortunately,\ndecompiler output is far from readable because the decompilation process\nis often incomplete. State-of-the-art techniques use machine learning to\npredict missing information like variable names. While these approaches\nare often able to suggest good variable names in context, no existing\nwork examines how the selection of training data influences these\nmachine learning models. We investigate how data provenance and the\nquality of training data affect performance, and how well, if at all,\ntrained models generalize across software domains. We focus on the\nvariable renaming problem using one such machine learning model, DIRE.\nWe first describe DIRE in detail and the accompanying technique used to\ngenerate training data from raw code. We also evaluate DIRE's overall\nperformance without respect to data quality. Next, we show how training\non more popular, possibly higher quality code (measured using GitHub\nstars) leads to a more generalizable model because popular code tends to\nhave more diverse variable names. Finally, we evaluate how well DIRE\npredicts domain-specific identifiers, propose a modification to\nincorporate domain information, and show that it can predict identifiers\nin domain-specific scenarios 23\\% more frequently than the original DIRE\nmodel.",
    "ENTRYTYPE": "article",
    "ID": "WOS:000970588900012"
  },
  {
    "year": "2024",
    "web-of-science-index": "Science Citation Index Expanded (SCI-EXPANDED)",
    "web-of-science-categories": "Computer Science, Artificial Intelligence; Computer Science, Software\nEngineering; Engineering, Electrical \\& Electronic",
    "volume": "34",
    "usage-count-since-2013": "6",
    "usage-count-last-180-days": "2",
    "unique-id": "WOS:001332656400001",
    "type": "Article",
    "title": "IRaDT: LLVM IR as Target for Efficient Neural Decompilation",
    "times-cited": "1",
    "research-areas": "Computer Science; Engineering",
    "publisher": "WORLD SCIENTIFIC PUBL CO PTE LTD",
    "pages": "1971-1992",
    "number-of-cited-references": "32",
    "number": "12",
    "month": "DEC",
    "language": "English",
    "keywords": "Decompilation; LLVM immediate representation; pre-trained language\nmodel; neural machine translation",
    "journal-iso": "Int. J. Softw. Eng. Knowl. Eng.",
    "journal": "INTERNATIONAL JOURNAL OF SOFTWARE ENGINEERING AND KNOWLEDGE ENGINEERING",
    "issn": "0218-1940",
    "funding-text": "This research is supported by Key Laboratory of Trustworthy Distributed\nComputing and Service, MoE (Beijing University of Posts and\nTelecommunications).",
    "funding-acknowledgement": "Key Laboratory of Trustworthy Distributed Computing and Service, MoE\n(Beijing University of Posts and Telecommunications)",
    "eissn": "1793-6403",
    "earlyaccessdate": "OCT 2024",
    "doi": "10.1142/S0218194024500463",
    "doc-delivery-number": "P1V6S",
    "da": "2026-02-04",
    "cited-references": "{[}Anonymous], 2024, GHIDRA SOFTWARE REVE.\n{[}Anonymous], 2024, IDA Pro: A Powerful Disassembler, Decompiler and a Versatile Debugger.\n{[}Anonymous], 2024, Clang: A C Language Family Frontend for LLVM.\n{[}Anonymous], 2024, The LLVM Compiler Infrastructure.\nArmengol-Estapé J, 2024, INT SYM CODE GENER, P67, DOI 10.1109/CGO57630.2024.10444788.\nCummins C., 2023, ARXIV.\nCummins C, 2021, PR MACH LEARN RES, V139.\nda Silva AF, 2021, INT SYM CODE GENER, P378, DOI 10.1109/CGO51591.2021.9370322.\nDevlin J., 2018, arXiv.\nFeng ZY, 2020, FINDINGS OF THE ASSOCIATION FOR COMPUTATIONAL LINGUISTICS, EMNLP 2020, P1536.\nFu C, 2019, ADV NEUR IN, V32.\nFu ZH, 2023, AAAI CONF ARTIF INTE, P12799.\nGuo D., 2021, INT C LEARNING REPRE.\nGuo DY, 2022, PROCEEDINGS OF THE 60TH ANNUAL MEETING OF THE ASSOCIATION FOR COMPUTATIONAL LINGUISTICS (ACL 2022), VOL 1: (LONG PAPERS), P7212.\nHosseini I., 2022, P WORKSH BIN AN RES.\nHu E.J ..., 2022, ICLR.\nJiang N., 2023, ArXiv.\nKatz D. S., 2018, USING RECURRENT NEUR, P346.\nLewis M., 2020, P 58 ANN M ASS COMPU, P7871, DOI 10.18653/v1/2020.acl-main.703.\nMou LL, 2016, AAAI CONF ARTIF INTE, P1287.\nNiu CG, 2023, PROC INT CONF SOFTW, P2136, DOI 10.1109/ICSE48619.2023.00180.\nOpenAI, 2024, GPT-4 Technical Report.\nPapineni K, 2002, 40TH ANNUAL MEETING OF THE ASSOCIATION FOR COMPUTATIONAL LINGUISTICS, PROCEEDINGS OF THE CONFERENCE, P311, DOI 10.3115/1073083.1073135.\nRadford Alec., 2019, Language Models are Unsupervised Multitask Learners, V1, P9.\nRaffel C, 2020, J MACH LEARN RES, V21.\nRetdec, 2024, RETARGETABLE MACHINE.\nRoziere B., 2022, INT C LEARN REPR.\nShazeer N, 2018, PR MACH LEARN RES, V80.\nSong KT, 2019, PR MACH LEARN RES, V97.\nTan H., 2024, arXiv.\nVaswani A, 2017, ADV NEUR IN, V30.\nWang Y, 2021, 2021 CONFERENCE ON EMPIRICAL METHODS IN NATURAL LANGUAGE PROCESSING (EMNLP 2021), P8696.",
    "author-email": "yuzhang.lee@outlook.com\nxtao@tsinghua.edu.cn\nwangcl@bupt.edu.cn",
    "author": "Li, Yuzhang and Xu, Tao and Wang, Chunlu",
    "affiliations": "Tsinghua University",
    "affiliation": "Li, YZ (Corresponding Author), Beijing Univ Posts \\& Telecommun Beijing, Sch Cyberspace Secur, Beijing, Peoples R China.\nLi, Yuzhang; Wang, Chunlu, Beijing Univ Posts \\& Telecommun Beijing, Sch Cyberspace Secur, Beijing, Peoples R China.\nXu, Tao, Tsinghua Univ, Dept Comp Sci \\& Technol, Beijing, Peoples R China.",
    "address": "5 TOH TUCK LINK, SINGAPORE 596224, SINGAPORE",
    "abstract": "Decompilation is a widely utilized technique in reverse engineering,\naimed at restoring binary code to human-readable high-level language\ncode. However, the readability of the output from traditional\ndecompilers is often poor. With advancements in language models, several\nlearning-based decompilation methods have emerged. Nevertheless, the\nprobabilistic nature of language models leads to outputs whose\ncorrectness cannot be guaranteed, necessitating further analysis by\nengineers to identify the corresponding functionality of the code.\nInspired by compiler toolchains, we propose a novel approach to enhance\nthe effectiveness of language models in decompilation tasks. Traditional\nrule-based methods and learning-based techniques are fused together in\nour approach, drawing insights from both paradigms. Specifically, we\npresent a pre-trained sequence-to-sequence model called IRaDT tailored\nto refine decompilation outputs at the intermediate representation\nlevel. Through this hybridization, we aim to address the limitations of\nexisting methodologies and achieve more accurate and robust\ndecompilation. We construct a diverse decompilation dataset targeting IR\nand evaluated IRaDT based on this dataset. The experimental results\nindicate that IRaDT has the ability to improve the readability of IR\nwhile ensuring its compileability, achieving a 74\\% improvement compared\nto RetDec and a 93\\% improvement compared to ChatGPT.",
    "ENTRYTYPE": "article",
    "ID": "WOS:001332656400001"
  },
  {
    "year": "2025",
    "web-of-science-index": "Science Citation Index Expanded (SCI-EXPANDED)",
    "web-of-science-categories": "Computer Science, Artificial Intelligence; Computer Science, Software\nEngineering; Engineering, Electrical \\& Electronic",
    "volume": "35",
    "usage-count-since-2013": "8",
    "usage-count-last-180-days": "8",
    "unique-id": "WOS:001539888300001",
    "type": "Article",
    "title": "Modernizing 90s Era Software to a New Language and Environment Using\nLLMs - An Empirical Investigation",
    "times-cited": "0",
    "researcherid-numbers": "ašković, ažen/U-1113-2018\nDraskovic, Drazen/U-1113-2018",
    "research-areas": "Computer Science; Engineering",
    "publisher": "WORLD SCIENTIFIC PUBL CO PTE LTD",
    "pages": "1099-1119",
    "orcid-numbers": "Bojic, agan/0009-0001-3025-5886\našković, ažen/0000-0003-2564-4526",
    "number-of-cited-references": "23",
    "number": "08",
    "month": "AUG",
    "language": "English",
    "keywords": "Decompilation; software translation; machine learning",
    "journal-iso": "Int. J. Softw. Eng. Knowl. Eng.",
    "journal": "INTERNATIONAL JOURNAL OF SOFTWARE ENGINEERING AND KNOWLEDGE ENGINEERING",
    "issn": "0218-1940",
    "funding-text": "This research was supported by the Science Fund of the Republic of\nSerbia, Grant No 11113, Software for Text Offences Prevention in\nSerbian: Al-driven Hate Speech Detection - STOP.",
    "funding-acknowledgement": "Science Fund of the Republic of Serbia {[}11113]; Software for Text\nOffences Prevention in Serbian: Al-driven Hate Speech Detection - STOP",
    "eissn": "1793-6403",
    "earlyaccessdate": "JUL 2025",
    "doi": "10.1142/S021819402550024X",
    "doc-delivery-number": "6DL6W",
    "da": "2026-02-04",
    "cited-references": "{[}Anonymous], 2021, 2911942021EN ISOIECI.\n{[}Anonymous], 2019, ROCKET UNIVERSE DATA.\narchive.org, INTERNET ARCHIVE SOF.\nBoehm B., 2005, CROSSTALK J DEFENSE, V18, P20.\nBojic DM, 2016, INT J SOFTW ENG KNOW, V26, P953, DOI 10.1142/S0218194016500327.\nClaburn T., REGISTER.\ngithub.com, C2RUST TRANSPILER MI.\nIgnjatovic M., 2015, TELFOR J, V7.\ninformatik.hu-berlin, 2002, XCTL PROJEKT SOFTWAR.\nJang WS, 2022, APPL SCI-BASEL, V12, DOI 10.3390/app12189310.\nKrupalija E., 2022, 24 IEEE ACIS INT WIN, P162, DOI {[}10.1109/SNPD54884.2022.10051799, DOI 10.1109/SNPD54884.2022.10051799].\nLachaux M-A, 2020, ARXIV.\nMyers GJ, 2012, ART OF SOFTWARE TESTING, 3RD EDITION, P1.\nPARNAS DL, 1994, PROC INT CONF SOFTW, P279, DOI 10.1109/ICSE.1994.296790.\nRazavian M., 2013, THESIS VRIJE U AMSTE.\nRohleder R, 2019, SPRO'19: PROCEEDINGS OF THE 3RD ACM WORKSHOP ON SOFTWARE PROTECTION, P77, DOI 10.1145/3338503.3357725.\nRoziere B., 2021, P INT C LEARN REPR.\nRoziere Baptiste, 2020, Advances in Neural Information Processing Systems, V33.\nSzafraniec M., 2022, P 11 INT C LEARN REP.\nVelasevic D., 1997, INFO SCI, V5, P4.\nWang YN, 2018, ADV NEUR IN, V31.\nZhen Yang, 2024, Proceedings of the ACM on Software Engineering, V1, DOI {[}10.1145/3660778, 10.1145/3660778].\nZhong H., 2010, P 32 ACMIEEE INT C S, P195, DOI {[}DOI 10.1145/1806799.1806831, 10.1145/1806799.1806831].",
    "author-email": "bojic@etf.bg.ac.rs\ndrazen.draskovic@etf.bg.ac.rs",
    "author": "Bojic, Dragan and Draskovic, Drazen",
    "affiliations": "University of Belgrade",
    "affiliation": "Draskovic, D (Corresponding Author), Univ Belgrade, Sch Elect Engn, Bulevar Kralja Aleksandra 73, Belgrade 11120, Serbia.\nBojic, Dragan; Draskovic, Drazen, Univ Belgrade, Sch Elect Engn, Bulevar Kralja Aleksandra 73, Belgrade 11120, Serbia.",
    "address": "5 TOH TUCK LINK, SINGAPORE 596224, SINGAPORE",
    "abstract": "Legacy software, particularly from the 1990s, often becomes obsolete due\nto aging hardware and outdated software environments. Traditionally,\nsoftware modernization required extensive manual effort, involving\nreverse engineering, code rewriting, and re-architecting. However,\nadvancements in large language models (LLMs) have introduced new\npossibilities for automating software translation and modernization.\nThis paper explores the feasibility of using LLMs for modernizing\n90s-era Windows applications, specifically migrating legacy C and C++\ncode to Python. Our methodology includes decompilation, source code\nanalysis, automated translation using ChatGPT, and user interface\nreconstruction. We empirically evaluate three software projects by\nanalyzing LLM-based translation accuracy across different code\nstructures, including algorithmic logic, file handling, and graphical\ninterfaces. Results indicate that while LLMs achieve high translation\naccuracy (-88\\%) for structured code, challenges persist in handling\ndecompiled code and user interface generation. The study provides\ninsights into the effectiveness and limitations of LLMs in real-world\nsoftware renovation, offering guidelines for leveraging machine learning\nin legacy system modernization. These findings contribute to both\nacademic research and practical applications, suggesting a pathway for\ncost-effective and scalable legacy software migration.",
    "ENTRYTYPE": "article",
    "ID": "WOS:001539888300001"
  },
  {
    "year": "2025",
    "web-of-science-index": "Science Citation Index Expanded (SCI-EXPANDED)",
    "web-of-science-categories": "Computer Science, Information Systems; Engineering, Electrical \\&\nElectronic; Physics, Applied",
    "volume": "14",
    "usage-count-since-2013": "1",
    "usage-count-last-180-days": "1",
    "unique-id": "WOS:001623665300001",
    "type": "Article",
    "title": "Interactive End-to-End Decompilation via Large Language Models",
    "times-cited": "1",
    "researcherid-numbers": "Shi, Xiaoming/AAU-4105-2021\nXIN, WANG/KGK-5385-2024\n朱, 庆福/HGE-1466-2022",
    "research-areas": "Computer Science; Engineering; Physics",
    "publisher": "MDPI",
    "orcid-numbers": "Li, Bohan/0000-0003-1168-8018\n冯, 云龙/0000-0002-0561-8841",
    "oa": "gold",
    "number-of-cited-references": "30",
    "number": "22",
    "month": "NOV 14",
    "language": "English",
    "keywords": "large language model; code generation",
    "journal-iso": "Electronics",
    "journal": "ELECTRONICS",
    "issn": "2079-9292",
    "funding-text": "This research was funded by the National Natural Science Foundation of\nChina (NSFC), grant numbers 62236004, 62206078, 62441603 and 62476073.",
    "funding-acknowledgement": "National Natural Science Foundation of China (NSFC) {[}62236004,\n62206078, 62441603, 62476073]",
    "doi": "10.3390/electronics14224442",
    "doc-delivery-number": "F5618",
    "da": "2026-02-04",
    "cited-references": "Armengol-estape Jordi, 2022, MAPS 2022: Proceedings of the 6th ACM SIGPLAN International Symposium on Machine Programming, P50, DOI 10.1145/3520312.3534867.\nArmengol-Estape J, 2024, Arxiv, DOI {[}arXiv:2305.12520, 10.48550/ARXIV.2305.12520 2305.12520, DOI 10.48550/ARXIV.2305.125202305.12520].\nBalakrishnan G, 2007, LECT NOTES COMPUT SC, V4349, P1.\nBasque ZL, 2024, PROCEEDINGS OF THE 33RD USENIX SECURITY SYMPOSIUM, SECURITY 2024, P361.\nChen M., 2021, Evaluating large language models trained on code, DOI DOI 10.48550/ARXIV.2107.03374.\nDao T., 2024, P INT C LEARNING REP.\nFeng YL, 2024, FINDINGS OF THE ASSOCIATION FOR COMPUTATIONAL LINGUISTICS: EMNLP 2024, P6603.\nGuo DY, 2024, Arxiv, DOI {[}arXiv:2401.14196, DOI 10.48550/ARXIV.2401.14196].\nHosseini Iman., 2022, arXiv, DOI {[}DOI 10.48550/ARXIV.2212.08950, 10.48550/arXiv.2212.08950].\nHu E.J., 2022, P INT C LEARNING REP.\nHu P., 2024, P 2024 NETWORK DISTR, VVolume 267622140.\nHui BY, 2024, Arxiv, DOI arXiv:2409.12186.\nJiang N, 2024, Arxiv, DOI arXiv:2311.13721.\nKatz DS, 2018, 2018 25TH IEEE INTERNATIONAL CONFERENCE ON SOFTWARE ANALYSIS, EVOLUTION AND REENGINEERING (SANER 2018), P346, DOI 10.1109/SANER.2018.8330222.\nKirchner K, 2017, PROCEEDINGS OF THE 12TH INTERNATIONAL CONFERENCE ON AVAILABILITY, RELIABILITY AND SECURITY (ARES 2017), DOI 10.1145/3098954.3103152.\nLacomis Jeremy, 2019, 2019 34th IEEE/ACM International Conference on Automated Software Engineering (ASE). Proceedings, P628, DOI 10.1109/ASE.2019.00064.\nLippincott T., 2020, P 15 ANN INT C ALLIA.\nLoshchilov I., 2019, P 7 INT C LEARNING R.\nOpenAI, 2023, Arxiv, DOI {[}arXiv:2303.08774, 10.48550/arXiv.2303.08774, DOI 10.48550/ARXIV.2303.08774].\nRoziere B, 2024, Arxiv, DOI {[}arXiv:2308.12950, DOI 10.48550/ARXIV.2308.12950].\nSchwartz Edward J., 2013, Proceedings of the 22nd USENIX Security Symposium. Security `13, P353.\nTan HZ, 2024, 2024 CONFERENCE ON EMPIRICAL METHODS IN NATURAL LANGUAGE PROCESSING, EMNLP 2024, P3473.\nVaswani A., 2017, ADV NEUR IN, P30, DOI DOI 10.48550/ARXIV.1706.03762.\nWang G., 2024, P INT C LEARNING REP.\nWang R., 2017, P NDSS.\nWei T, 2007, LECT NOTES COMPUT SC, V4634, P170.\nWeyssow M., 2025, ACM Transactions on Software Engineering and Methodology.\nWolf T, 2020, Arxiv, DOI {[}arXiv:1910.03771, DOI 10.48550/ARXIV.1910.03771].\nWong WK, 2023, Arxiv, DOI {[}arXiv:2310.06530, 10.48550/arXiv.2310.06530, DOI 10.48550/ARXIV.2310.06530].\nZheng YW, 2024, Arxiv, DOI {[}arXiv:2403.13372, DOI 10.48550/ARXIV.2403.13372].",
    "author-email": "ylfeng@ir.hit.edu.cn\nbhli@ir.hit.edu.cn\nxmshi@cs.ecnu.edu.cn\nqfzhu@ir.hit.edu.cn\ncar@ir.hit.edu.cn",
    "author": "Feng, Yunlong and Li, Bohan and Shi, Xiaoming and Zhu, Qingfu and Che,\nWanxiang",
    "article-number": "4442",
    "affiliations": "Harbin Institute of Technology; East China Normal University",
    "affiliation": "Zhu, QF; Che, WX (Corresponding Author), Harbin Inst Technol, Res Ctr Social Comp \\& Interact Robot, Harbin 150001, Peoples R China.\nFeng, Yunlong; Li, Bohan; Zhu, Qingfu; Che, Wanxiang, Harbin Inst Technol, Res Ctr Social Comp \\& Interact Robot, Harbin 150001, Peoples R China.\nShi, Xiaoming, East China Normal Univ, Sch Comp Sci \\& Technol, Shanghai 200062, Peoples R China.",
    "address": "MDPI AG, Grosspeteranlage 5, CH-4052 BASEL, SWITZERLAND",
    "abstract": "The goal of decompilation is to convert compiled low-level code (e.g.,\nassembly code) back into high-level programming languages, enabling\nanalysis in scenarios where source code is unavailable. This task\nsupports various reverse engineering applications, such as vulnerability\nidentification, malware analysis, and legacy software migration. The\nend-to-end decompilation method based on large language models (LLMs)\nreduces reliance on additional tools and minimizes manual intervention\ndue to its inherent properties. However, previous end-to-end methods\noften lose critical information necessary for reconstructing control\nflow structures and variables when processing binary files, making it\nchallenging to accurately recover the program's logic. To address these\nissues, we propose the ReF Decompile method, which incorporates the\nfollowing innovations: (1) The Relabeling strategy replaces jump target\naddresses with labels, preserving control flow clarity. (2) The Function\nCall strategy infers variable types and retrieves missing variable\ninformation from binary files. Experimental results on the\nHumaneval-Decompile Benchmark demonstrate that ReF Decompile surpasses\ncomparable baselines and achieves state-of-the-art (SOTA) performance of\n61.43\\%.",
    "ENTRYTYPE": "article",
    "ID": "WOS:001623665300001"
  },
  {
    "year": "2025",
    "web-of-science-index": "Science Citation Index Expanded (SCI-EXPANDED)",
    "web-of-science-categories": "Computer Science, Software Engineering; Engineering, Electrical \\&\nElectronic",
    "volume": "51",
    "usage-count-since-2013": "3",
    "usage-count-last-180-days": "3",
    "unique-id": "WOS:001639031400025",
    "type": "Article",
    "title": "Augmenting Smart Contract Decompiler Output Through Fine-Grained\nDependency Analysis and LLM-Facilitated Semantic Recovery",
    "times-cited": "1",
    "researcherid-numbers": "Nan, Yuhong/AAX-1436-2020",
    "research-areas": "Computer Science; Engineering",
    "publisher": "IEEE COMPUTER SOC",
    "pages": "3574-3590",
    "orcid-numbers": "Zixu, gao/0009-0004-9665-5075\nLiang, Henglong/0009-0008-9570-1067\nHao, Sicheng/0009-0009-5747-1093",
    "number-of-cited-references": "56",
    "number": "12",
    "month": "DEC",
    "language": "English",
    "keywords": "Smart contracts; Codes; Optimization; Source coding; Static analysis;\nLarge language models; Accuracy; Training; Semantics; Annotations; Smart\ncontract; decompilation; static analysis; large language model",
    "journal-iso": "IEEE Trans. Softw. Eng.",
    "journal": "IEEE TRANSACTIONS ON SOFTWARE ENGINEERING",
    "issn": "0098-5589",
    "funding-text": "This work was supported in part by the National Key Research and\nDevelopment Program of China under Grant 2023YFB2704100, in part by the\nNational Natural Science Foundation of China under Grant 62572497, in\npart by NSFC-RGC Collaborative Research under Grant 62461160332, and in\npart by Guangdong Zhujiang Talent Program under Grant 2023QN10X561",
    "funding-acknowledgement": "National Key Research and Development Program of China\n{[}2023YFB2704100]; National Natural Science Foundation of China\n{[}62572497]; NSFC-RGC Collaborative Research {[}62461160332]; Guangdong\nZhujiang Talent Program {[}2023QN10X561]",
    "eissn": "1939-3520",
    "doi": "10.1109/TSE.2025.3623325",
    "doc-delivery-number": "U8690",
    "da": "2026-02-04",
    "cited-references": "Al-Yarimi FAM, 2025, TSINGHUA SCI TECHNOL, V30, P978, DOI 10.26599/TST.2024.9010051.\nBadihi S, 2020, PROCEEDINGS OF THE 28TH ACM JOINT MEETING ON EUROPEAN SOFTWARE ENGINEERING CONFERENCE AND SYMPOSIUM ON THE FOUNDATIONS OF SOFTWARE ENGINEERING (ESEC/FSE `20), P13, DOI 10.1145/3368089.3409757.\nChen QB, 2022, PROCEEDINGS OF THE 31ST USENIX SECURITY SYMPOSIUM, P4327.\nChen T, 2022, IEEE T SOFTWARE ENG, V48, P3066, DOI 10.1109/TSE.2021.3078342.\nConsensys, Mythril.\nContro F, 2021, INT C PROGRAM COMPRE, P127, DOI 10.1109/ICPC52881.2021.00021.\nDavid Y, 2020, P ACM PROGRAM LANG, V4, DOI 10.1145/3428293.\nde Moura L, 2008, LECT NOTES COMPUT SC, V4963, P337, DOI 10.1007/978-3-540-78800-3\\_24.\nDramko L, 2024, PROCEEDINGS OF THE 33RD USENIX SECURITY SYMPOSIUM, SECURITY 2024, P379.\nethereum, Ethereum virtual machine.\netherscan, EtherScan.\nGao H, 2021, ISSTA `21: PROCEEDINGS OF THE 30TH ACM SIGSOFT INTERNATIONAL SYMPOSIUM ON SOFTWARE TESTING AND ANALYSIS, P607, DOI 10.1145/3460319.3464804.\ngithub, Tree-sitter.\ngithub, Smart contract statistic.\nGrech N, 2022, P ACM PROGRAM LANG, V6, DOI 10.1145/3527321.\nGrech N, 2018, P ACM PROGRAM LANG, V2, DOI 10.1145/3276486.\nGrech N, 2019, PROC INT CONF SOFTW, P1176, DOI 10.1109/ICSE.2019.00120.\nHe JH, 2023, Arxiv, DOI arXiv:2301.12695.\nHe JX, 2018, PROCEEDINGS OF THE 2018 ACM SIGSAC CONFERENCE ON COMPUTER AND COMMUNICATIONS SECURITY (CCS'18), P1667, DOI 10.1145/3243734.3243866.\nHu P., 2024, P 2024 NETWORK DISTR.\nJaffe A, 2018, INT C PROGRAM COMPRE, P20, DOI 10.1145/3196321.3196330.\nJin Xin, 2022, CCS `22: Proceedings of the 2022 ACM SIGSAC Conference on Computer and Communications Security, P1631, DOI 10.1145/3548606.3560612.\nLacomis Jeremy, 2019, 2019 34th IEEE/ACM International Conference on Automated Software Engineering (ASE). Proceedings, P628, DOI 10.1109/ASE.2019.00064.\nLai EM, 2020, 2020 4TH INTERNATIONAL CONFERENCE ON CRYPTOGRAPHY, SECURITY AND PRIVACY (ICCSP 2020), P110, DOI 10.1145/3377644.3377650.\nLi X., Fundamental Res..\nLi YC, 2024, P ACM PROGRAM LANG, V8, DOI 10.1145/3689711.\nLiao Zeqin, 2024, Proceedings of the ACM on Software Engineering, V1, DOI {[}10.1145/3643738, 10.1145/3643738].\nLiao ZQ, 2023, PROCEEDINGS OF THE 32ND ACM SIGSOFT INTERNATIONAL SYMPOSIUM ON SOFTWARE TESTING AND ANALYSIS, ISSTA 2023, P980, DOI 10.1145/3597926.3598111.\nLiao ZQ, 2022, PROCEEDINGS OF THE 31ST ACM SIGSOFT INTERNATIONAL SYMPOSIUM ON SOFTWARE TESTING AND ANALYSIS, ISSTA 2022, P752, DOI 10.1145/3533767.3534222.\nLiu H, 2024, PROCEEDINGS OF THE 33RD USENIX SECURITY SYMPOSIUM, SECURITY 2024, P3585.\nMa W, 2024, Arxiv, DOI {[}arXiv:2403.16073, DOI 10.48550/ARXIV.2403.16073].\nPang CB, 2021, P IEEE S SECUR PRIV, P833, DOI 10.1109/SP40001.2021.00012.\nPei K., 2020, arXiv.\nPeng JX, 2024, CHINESE J ELECTRON, V33, P128, DOI 10.23919/cje.2022.00.228.\nPeng Y, 2023, IEEE INT CONF AUTOM, P988, DOI 10.1109/ASE56229.2023.00031.\nPerson Suzette., 2008, P 16 ACM SIGSOFT INT, P226, DOI 10.1145/1453101.1453131.\nsolidity.readthedocs, Solidity.\nsoliditylang, Solidity release changelogs.\nSu J, 2023, CHINESE J ELECTRON, V32, P531, DOI 10.23919/cje.2022.00.103.\nSuiche M., 2017, Porosity: A Decompiler For Blockchain-Based Smart Contracts Bytecode.\nSun JL, 2022, TSINGHUA SCI TECHNOL, V27, P27, DOI 10.26599/TST.2020.9010036.\nSun KR, 2023, PROCEEDINGS OF THE 31ST ACM JOINT MEETING EUROPEAN SOFTWARE ENGINEERING CONFERENCE AND SYMPOSIUM ON THE FOUNDATIONS OF SOFTWARE ENGINEERING, ESEC/FSE 2023, P796, DOI 10.1145/3611643.3616270.\nWang W, 2025, TSINGHUA SCI TECHNOL, V30, P769, DOI 10.26599/TST.2024.9010019.\nWang Y., 2025, Fundamental Res., P1.\nWang Zexu, 2024, Proceedings of the ACM on Software Engineering, V1, DOI {[}10.1145/3643734, 10.1145/3643734].\nWilliams-King D, 2020, TWENTY-FIFTH INTERNATIONAL CONFERENCE ON ARCHITECTURAL SUPPORT FOR PROGRAMMING LANGUAGES AND OPERATING SYSTEMS (ASPLOS XXV), P133, DOI 10.1145/3373376.3378470.\nxblock.pro, Ethereum open-source smart contract.\nXing Su, 2025, Proceedings of the ACM on Software Engineering, V2, DOI {[}10.1145/3729373, 10.1145/3729373].\nYang S., 2024, PROC IEEEACM 46 INT, P1.\nYao JY, 2024, CHINESE J ELECTRON, V33, P1063, DOI 10.23919/cje.2023.00.233.\nZhang Z., 2019, PROC ACM PROGRAM, P1.\nZhang Z, 2021, P IEEE S SECUR PRIV, P813, DOI 10.1109/SP40001.2021.00051.\nZhao KS, 2023, PROCEEDINGS OF THE 31ST ACM JOINT MEETING EUROPEAN SOFTWARE ENGINEERING CONFERENCE AND SYMPOSIUM ON THE FOUNDATIONS OF SOFTWARE ENGINEERING, ESEC/FSE 2023, P745, DOI 10.1145/3611643.3616343.\nZheng ZB, 2024, IEEE T SOFTWARE ENG, V50, P1360, DOI 10.1109/TSE.2024.3383422.\nZhou SF, 2020, PROCEEDINGS OF THE 29TH USENIX SECURITY SYMPOSIUM, P2793.\nZhou Y, 2018, PROCEEDINGS OF THE 27TH USENIX SECURITY SYMPOSIUM, P1371.",
    "author-email": "liaozq8@mail2.sysu.edu.cn\nnanyh@mail.sysu.edu.cn\ngaozx9@mail2.sysu.edu.cn\nlianghlong@mail2.sysu.edu.cn\nhaosch@mail2.sysu.edu.cn\nrenpf@mail2.sysu.edu.cn\nzhzibin@mail.sysu.edu.cn",
    "author": "Liao, Zeqin and Nan, Yuhong and Gao, Zixu and Liang, Henglong and Hao,\nSicheng and Ren, Peifan and Zheng, Zibin",
    "affiliations": "Sun Yat Sen University",
    "affiliation": "Nan, YH (Corresponding Author), Sun Yat Sen Univ, Sch Software Engn, Zhuhai 519082, Peoples R China.\nNan, YH (Corresponding Author), Guangdong Engn Technol Res Ctr Blockchain, Zhuhai 519082, Peoples R China.\nLiao, Zeqin; Nan, Yuhong; Gao, Zixu; Liang, Henglong; Hao, Sicheng; Ren, Peifan; Zheng, Zibin, Sun Yat Sen Univ, Sch Software Engn, Zhuhai 519082, Peoples R China.\nLiao, Zeqin; Nan, Yuhong; Gao, Zixu; Liang, Henglong; Hao, Sicheng; Ren, Peifan; Zheng, Zibin, Guangdong Engn Technol Res Ctr Blockchain, Zhuhai 519082, Peoples R China.",
    "address": "10662 LOS VAQUEROS CIRCLE, PO BOX 3014, LOS ALAMITOS, CA 90720-1314 USA",
    "abstract": "Decompiler is a specialized type of reverse engineering tool extensively\nemployed in program analysis tasks, particularly in program\ncomprehension and vulnerability detection. However, current Solidity\nsmart contract decompilers face significant limitations in\nreconstructing the original source code. In particular, the bottleneck\nof SOTA decompilers lies in inaccurate function identification,\nincorrect variable type recovery, and missing contract attributes. These\ndeficiencies hinder downstream tasks and understanding of the program\nlogic. To address these challenges, we propose SmartHalo, a new\nframework that enhances decompiler output by combining static analysis\n(SA) and large language models (LLM). SmartHalo leverages the\ncomplementary strengths of SA's accuracy in control and data flow\nanalysis and LLM's capability in semantic prediction. More specifically,\nSmartHalo constructs a new data structure - Dependency Graph (DG), to\nextract semantic dependencies via static analysis. Then, it takes DG to\ncreate prompts for LLM optimization. Finally, the correctness of LLM\noutputs is validated through symbolic execution and formal verification.\nEvaluation on a dataset consisting of 465 randomly selected smart\ncontract functions shows that SmartHalo significantly improves the\nquality of the decompiled code, compared to SOTA decompilers (e.g.,\nGigahorse). Notably, integrating GPT-4o mini with SmartHalo further\nenhances its performance, achieving a precision of 91.32\\% and a recall\nof 87.38\\% for function boundaries, a precision of 90.40\\% and a recall\nof 88.82\\% for variable types, and a precision of 80.66\\% and a recall\nof 91.78\\% for contract attributes.",
    "ENTRYTYPE": "article",
    "ID": "WOS:001639031400025"
  },
  {
    "year": "2025",
    "web-of-science-index": "Science Citation Index Expanded (SCI-EXPANDED)",
    "web-of-science-categories": "Computer Science, Information Systems; Engineering, Electrical \\&\nElectronic; Physics, Applied",
    "volume": "15",
    "usage-count-since-2013": "3",
    "usage-count-last-180-days": "3",
    "unique-id": "WOS:001657340000001",
    "type": "Article",
    "title": "Research on Binary Decompilation Optimization Based on Fine-Tuned Large\nLanguage Models for Vulnerability Detection",
    "times-cited": "0",
    "research-areas": "Computer Science; Engineering; Physics",
    "publisher": "MDPI",
    "oa": "gold",
    "number-of-cited-references": "46",
    "number": "1",
    "month": "DEC 19",
    "language": "English",
    "keywords": "decompilation; vulnerability detection; large language models; fine\ntuning; binary code",
    "journal-iso": "Electronics",
    "journal": "ELECTRONICS",
    "issn": "2079-9292",
    "funding-text": "This research was funded by the Sichuan Provincial Major Scientific and\nTechnological Special Project on Artificial Intelligence under Grant\n2024ZDZX007. The APC was funded by the 30th Research Institute of China\nElectronics Technology Group Corporation.",
    "funding-acknowledgement": "30th Research Institute of China Electronics Technology Group\nCorporation; Sichuan Provincial Major Scientific and Technological\nSpecial Project on Artificial Intelligence {[}2024ZDZX007]",
    "doi": "10.3390/electronics15010008",
    "doc-delivery-number": "AU9AJ",
    "da": "2026-02-04",
    "cited-references": "Armengol-estape Jordi, 2022, MAPS 2022: Proceedings of the 6th ACM SIGPLAN International Symposium on Machine Programming, P50, DOI 10.1145/3520312.3534867.\nArmengol-Estapé J, 2024, INT SYM CODE GENER, P67, DOI 10.1109/CGO57630.2024.10444788.\nBigCode Project, 2024, StarCoder2.\nBurk K, 2022, PROCEEDINGS OF THE 31ST USENIX SECURITY SYMPOSIUM, P2765.\nByteDance Doubao, 2024, AI Chatbot.\nChen M., 2021, Evaluating large language models trained on code, DOI DOI 10.48550/ARXIV.2107.03374.\nChukkol AHA, 2024, Arxiv, DOI arXiv:2408.07181.\nDutra R, 2024, ACM T SOFTW ENG METH, V33, DOI 10.1145/3628157.\nEngel D, 2023, LECT NOTES COMPUT SC, V14066, P3, DOI 10.1007/978-3-031-38828-6\\_1.\nFeng YL, 2025, ELECTRONICS-SWITZ, V14, DOI 10.3390/electronics14224442.\nFevid E., 2024, Authorea Prepr, DOI {[}10.36227/techrxiv.172565769.90012316, DOI 10.36227/TECHRXIV.172565769.90012316].\ngithub, 2025, Tencent CodeAnalysis.\ngithub, 2023, WPeace-HcH WPeChatGPT Version 2.3.\nGuo DY, 2024, Arxiv, DOI {[}arXiv:2401.14196, DOI 10.48550/ARXIV.2401.14196].\nHe JX, 2021, CCS `21: PROCEEDINGS OF THE 2021 ACM SIGSAC CONFERENCE ON COMPUTER AND COMMUNICATIONS SECURITY, P2526, DOI 10.1145/3460120.3484813.\nHex-Rays, 2025, SA IDA Pro: A Cross-Platform Multi-Processor Disassembler and Debugger.\nHosseini Iman., 2022, arXiv, DOI {[}DOI 10.48550/ARXIV.2212.08950, 10.48550/arXiv.2212.08950].\nHui BY, 2024, Arxiv, DOI arXiv:2409.12186.\nJiang N, 2024, Arxiv, DOI arXiv:2311.13721.\nKatz DS, 2018, 2018 25TH IEEE INTERNATIONAL CONFERENCE ON SOFTWARE ANALYSIS, EVOLUTION AND REENGINEERING (SANER 2018), P346, DOI 10.1109/SANER.2018.8330222.\nKatz O, 2019, Arxiv, DOI arXiv:1905.08325.\nLi D, 2024, MACH LEARN KNOW EXTR, V6, P1087, DOI 10.3390/make6020050.\nLi RY, 2023, Arxiv, DOI arXiv:2305.06161.\nLi YZ, 2024, INT J SOFTW ENG KNOW, V34, P1971, DOI 10.1142/S0218194024500463.\nLiu Z., 2022, P INT C ALGORITHMS A, P392.\nLuo Z., 2023, P NDSS.\nMassarelli L, 2022, IEEE T DEPEND SECURE, V19, P2259, DOI 10.1109/TDSC.2021.3051852.\nMeta Code Llama, 2023, Official Webpage for Code Llama, a Code Generation LLM Developed by Meta.\nNational Security Agency (NSA), 2021, Ghidra (Open-Source Reverse Engineering Tool).\nOllama Wizard Coder, 2023, Ollama Library Webpage for Wizard Coder (Code Generation Model Based on Code Llama); Multiple Versions Available: Initial Release (2023-09-07) and 33B Version (2024-01-04).\nPoeplau S, 2021, 28TH ANNUAL NETWORK AND DISTRIBUTED SYSTEM SECURITY SYMPOSIUM (NDSS 2021), DOI 10.14722/ndss.2021.23118.\nRoziere B, 2024, Arxiv, DOI {[}arXiv:2308.12950, DOI 10.48550/ARXIV.2308.12950].\nSang Q, 2024, P IEEE S SECUR PRIV, P3998, DOI 10.1109/SP54263.2024.00045.\nSchwartz Edward J., 2013, Proceedings of the 22nd USENIX Security Symposium. Security `13, P353.\nShe XY, 2024, IEEE INT CONF AUTOM, P481, DOI 10.1145/3691620.3695020.\nTan HZ, 2024, Arxiv, DOI arXiv:2403.05286.\nUl Haq I, 2022, ACM COMPUT SURV, V54, DOI 10.1145/3446371.\nVerbeek F, 2024, PROCEEDINGS OF THE 2024 ACM SIGSAC CONFERENCE ON COMPUTER AND COMMUNICATIONS SECURITY, CCS 2024, P2786, DOI 10.1145/3658644.3690244.\nWei XY, 2024, J NETW COMPUT APPL, V232, DOI 10.1016/j.jnca.2024.104020.\nWong WK, 2023, Arxiv, DOI {[}arXiv:2310.06530, 10.48550/arXiv.2310.06530, DOI 10.48550/ARXIV.2310.06530].\nXiao Y, 2021, 2021 IEEE INTERNATIONAL CONFERENCE ON SOFTWARE ANALYSIS, EVOLUTION AND REENGINEERING (SANER 2021), P213, DOI 10.1109/SANER50967.2021.00028.\nYan H, 2021, COMPUT SECUR, V108, DOI 10.1016/j.cose.2021.102286.\nYang SG, 2023, ACM T SOFTW ENG METH, V32, DOI 10.1145/3604608.\nYang Y., 2023, P INT S DEPENDABLE S, P351.\nZheng PL, 2022, PROCEEDINGS OF THE 31ST ACM SIGSOFT INTERNATIONAL SYMPOSIUM ON SOFTWARE TESTING AND ANALYSIS, ISSTA 2022, P740, DOI 10.1145/3533767.3534395.\nZheng YW, 2024, Arxiv, DOI {[}arXiv:2403.13372, DOI 10.48550/ARXIV.2403.13372].",
    "author-email": "wangyd19257@cetcsc.com\nmdm1201@126.com",
    "author": "Wang, Yidan and Mao, Deming and Han, Ye and Tao, Rui",
    "article-number": "8",
    "affiliations": "China Electronics Technology Group",
    "affiliation": "Mao, DM (Corresponding Author), China Elect Technol Grp Corp, Res Inst 30, Chengdu 610093, Peoples R China.\nWang, Yidan; Mao, Deming; Han, Ye; Tao, Rui, China Elect Technol Grp Corp, Res Inst 30, Chengdu 610093, Peoples R China.",
    "address": "MDPI AG, Grosspeteranlage 5, CH-4052 BASEL, SWITZERLAND",
    "abstract": "The proliferation of binary vulnerabilities in the software supply chain\nhas become a critical security challenge. Existing vulnerability\ndetection approaches-including dynamic analysis, static analysis, and\ndecompilation-assisted analysis-all suffer from limitations such as\ninsufficient coverage, high false-positive and false-negative rates, or\npoor compatibility. Although decompilation technology can serve as a\nbridge connecting binary-code and source-code vulnerability detection\ntools, current schemes suffer from inadequate semantic restoration\nquality and lack of tool compatibility. To address these issues, this\npaper proposes LLMVulDecompiler, a binary decompilation model based on\nfine-tuned large language models designed to generate high-precision\ndecompiled code that integrates directly with source-code static\nanalysis tools. We construct a dedicated training and evaluation dataset\nthat covers multiple compiler optimization levels (e.g., O0-O3) and a\ndiverse set of program functionalities. We adopt a two-stage fine-tuning\nstrategy that involves first building foundational decompilation\ncapabilities, then enhancing vulnerability-specific features.\nAdditionally, we design a low-cost inference pipeline and establish\nmulti-dimensional evaluation criteria, including restoration similarity,\ncompilation success rate, and functional correctness. Experimental\nresults show that the model significantly outperforms baseline models in\nterms of average edit distance, compilation success rate, and black-box\ntest pass rate on the HumanEval-C benchmark. In tests on 12 real-world\nCVE (Common Vulnerabilities and Exposures) instances, the approach\nachieved a detection accuracy of 91.7\\%, with substantially reduced\nfalse-positive and false-negative rates. This study demonstrates the\neffectiveness of specialized fine-tuning of large language models for\nbinary decompilation and vulnerability detection, offering a new pathway\nfor binary security analysis.",
    "ENTRYTYPE": "article",
    "ID": "WOS:001657340000001"
  },
  {
    "year": "2023",
    "title": "Exploring the Limits of ChatGPT in Software Security Applications",
    "note": "",
    "month": "dec",
    "howpublished": "\\url{https://arxiv.org/pdf/2312.05275}",
    "doi": "https://doi.org/10.48550/arXiv.2312.05275",
    "author": "Wu, Fangzhou AND Zhang, Qingzhao AND Bajaj, Priya, Ati AND Bao, Tiffany AND Zhang, Ning AND Wang, \"Fish\", Ruoyu AND Xiao, Chaowei",
    "abstract": "Large language models (LLMs) have undergone rapid evolution and achieved remarkable results in recent times. OpenAI's ChatGPT, backed by GPT-3.5 or GPT-4, has gained instant popularity due to its strong capability across a wide range of tasks, including natural language tasks, coding, mathematics, and engaging conversations. However, the impacts and limits of such LLMs in system security domain are less explored. In this paper, we delve into the limits of LLMs (i.e., ChatGPT) in seven software security applications including vulnerability detection/repair, debugging, debloating, decompilation, patching, root cause analysis, symbolic execution, and fuzzing. Our exploration reveals that ChatGPT not only excels at generating code, which is the conventional application of language models, but also demonstrates strong capability in understanding user-provided commands in natural languages, reasoning about control and data flows within programs, generating complex data structures, and even decompiling assembly code. Notably, GPT-4 showcases significant improvements over GPT-3.5 in most security tasks. Also, certain limitations of ChatGPT in security-related tasks are identified, such as its constrained ability to process long code contexts. ",
    "ENTRYTYPE": "article",
    "ID": "Wu2023"
  },
  {
    "year": "2025",
    "title": "DeQompile: quantum circuit decompilation using genetic programming for explainable quantum architecture search",
    "note": "",
    "month": "apr",
    "howpublished": "\\url{https://arxiv.org/pdf/2504.08310}",
    "doi": "https://doi.org/10.48550/arXiv.2504.08310",
    "author": "Xie, Shubing AND Sarkar, Aritra AND Feld, Sebastian",
    "abstract": "Demonstrating quantum advantage using conventional quantum algorithms remains challenging on current noisy gate-based quantum computers. Automated quantum circuit synthesis via quantum machine learning has emerged as a promising solution, employing trainable parametric quantum circuits to alleviate this. The circuit ansatz in these solutions is often designed through reinforcement learning-based quantum architecture search when the domain knowledge of the problem and hardware are not effective. However, the interpretability of these synthesized circuits remains a significant bottleneck, limiting their scalability and applicability across diverse problem domains. This work addresses the challenge of explainability in quantum architecture search (QAS) by introducing a novel genetic programming-based decompiler framework for reverse-engineering high-level quantum algorithms from low-level circuit representations. The proposed approach, implemented in the open-source tool DeQompile, employs program synthesis techniques, including symbolic regression and abstract syntax tree manipulation, to distill interpretable Qiskit algorithms from quantum assembly language. Validation of benchmark algorithms demonstrates the efficacy of our tool. By integrating the decompiler with online learning frameworks, this research potentiates explainable QAS by fostering the development of generalizable and provable quantum algorithms. ",
    "ENTRYTYPE": "article",
    "ID": "Xie2025"
  },
  {
    "year": "2025",
    "title": "D-LiFT: Improving LLM-based Decompiler Backend via Code Quality-driven Fine-tuning",
    "note": "",
    "month": "aug",
    "howpublished": "\\url{https://arxiv.org/pdf/2506.10125}",
    "doi": "https://doi.org/10.48550/arXiv.2506.10125",
    "author": "Zou, Muqi AND Cai, Hongyu AND Wu, Hongwei AND Basque, Leonahenahe, Zion AND Khan, Arslan AND Celik, Berkay AND Dave AND Tian AND Bianchi, Antonio AND Ruoyu AND Wang AND Xu, Dongyan",
    "abstract": "As one of the key tools in many security tasks, decompilers reconstruct human-readable source code from binaries. Yet, despite recent advances, their outputs often suffer from syntactic and semantic errors and remain difficult to read. Recently, with the advent of large language models (LLMs), researchers began to explore the potential of LLMs to refine decompiler output. Nevertheless, our study of these approaches reveals their problems, such as introducing new errors and relying on unreliable accuracy validation. In this paper, we present D-LIFT, an enhanced decompiler-LLM pipeline with a fine-tuned LLM using code quality-aware reinforcement learning. Unlike prior work that overlooks preserving accuracy, D-LIFT adheres to a key principle for enhancing the quality of decompiled code: preserving accuracy while improving readability. Central to D-LIFT, we propose D-Score, an integrated code quality assessment system to score the decompiled source code from multiple aspects, and use it to guide reinforcement learning fine-tuning and to select the best output during inference. In line with our principle, D-Score assigns low scores to any inaccurate output and only awards higher scores for readability to code that passes the accuracy check. Our implementation, based on Ghidra and a range of LLMs, demonstrates significant improvements for the accurate decompiled code from the coreutils and util-linux projects. Compared to baseline LLMs without D-Score-driven fine-tuning, our trained LLMs produce 55.3% more improved decompiled functions, as measured by D-Score. Overall, D-LIFT improves the quality of 68.2% of all the functions produced by the native decompiler. ",
    "ENTRYTYPE": "article",
    "ID": "Zou2025"
  }
]